#[test]
fn version_size_01() {
    let mat = crate::default::create_matrix_from_version(1);
    let length = mat.len();
    assert_eq!(length, 21);
}
#[test]
fn version_size_03() {
    let mat = crate::default::create_matrix_from_version(3);
    let length = mat.len();
    assert_eq!(length, 29);
}
#[test]
fn version_size_22() {
    let mat = crate::default::create_matrix_from_version(22);
    let length = mat.len();
    assert_eq!(length, 105);
}
#[test]
fn version_size_40() {
    let mat = crate::default::create_matrix_from_version(40);
    let length = mat.len();
    assert_eq!(length, 177);
}

#[test]
fn position_pattern_03() {
    let mat = crate::default::create_matrix_from_version(3);
    // Top line
    assert!(mat[0][0]);
    assert!(mat[0][1]);
    assert!(mat[0][2]);
    assert!(mat[0][3]);
    assert!(mat[0][4]);
    assert!(mat[0][5]);
    assert!(mat[0][6]);

    // Left line
    assert!(mat[1][0]);
    assert!(mat[2][0]);
    assert!(mat[3][0]);
    assert!(mat[4][0]);
    assert!(mat[5][0]);
    assert!(mat[6][0]);

    // Right line
    assert!(mat[1][6]);
    assert!(mat[2][6]);
    assert!(mat[3][6]);
    assert!(mat[4][6]);
    assert!(mat[5][6]);
    assert!(mat[6][6]);

    // Bottom line
    assert!(mat[6][0]);
    assert!(mat[6][1]);
    assert!(mat[6][2]);
    assert!(mat[6][3]);
    assert!(mat[6][4]);
    assert!(mat[6][5]);
    assert!(mat[6][6]);

    // Inside square
    assert!(mat[2][2]);
    assert!(mat[2][3]);
    assert!(mat[2][4]);
    assert!(mat[3][2]);
    assert!(mat[3][3]);
    assert!(mat[3][4]);
    assert!(mat[4][2]);
    assert!(mat[4][3]);
    assert!(mat[4][4]);
}

/// Checks it's empty
#[test]
fn position_pattern_01() {
    let mat = crate::default::create_matrix_from_version(1);

    for i in 7..21 {
        for j in 7..21 {
            // Dark module
            if i == 13 && j == 8 {
                continue;
            }
            assert_eq!(mat[i][j], false);
        }
    }
}

#[test]
fn generator_polynomial_7() {
    let poly = crate::generator_polynomial::generator(7);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x7 + α87x6 + α229x5 + α146x4 + α149x3 + α238x2 + α102x + α21"
    )
}

#[test]
fn generator_polynomial_8() {
    let poly = crate::generator_polynomial::generator(8);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x8 + α175x7 + α238x6 + α208x5 + α249x4 + α215x3 + α252x2 + α196x + α28"
    )
}

#[test]
fn generator_polynomial_9() {
    let poly = crate::generator_polynomial::generator(9);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x9 + α95x8 + α246x7 + α137x6 + α231x5 + α235x4 + α149x3 + α11x2 + α123x + α36"
    )
}

#[test]
fn generator_polynomial_10() {
    let poly = crate::generator_polynomial::generator(10);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x10 + α251x9 + α67x8 + α46x7 + α61x6 + α118x5 + α70x4 + α64x3 + α94x2 + α32x + α45"
    )
}

#[test]
fn generator_polynomial_11() {
    let poly = crate::generator_polynomial::generator(11);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x11 + α220x10 + α192x9 + α91x8 + α194x7 + α172x6 + α177x5 + α209x4 + α116x3 + α227x2 + α10x + α55"
    )
}

#[test]
fn generator_polynomial_12() {
    let poly = crate::generator_polynomial::generator(12);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x12 + α102x11 + α43x10 + α98x9 + α121x8 + α187x7 + α113x6 + α198x5 + α143x4 + α131x3 + α87x2 + α157x + α66"
    )
}

#[test]
fn generator_polynomial_13() {
    let poly = crate::generator_polynomial::generator(13);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x13 + α74x12 + α152x11 + α176x10 + α100x9 + α86x8 + α100x7 + α106x6 + α104x5 + α130x4 + α218x3 + α206x2 + α140x + α78"
    )
}

#[test]
fn generator_polynomial_14() {
    let poly = crate::generator_polynomial::generator(14);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x14 + α199x13 + α249x12 + α155x11 + α48x10 + α190x9 + α124x8 + α218x7 + α137x6 + α216x5 + α87x4 + α207x3 + α59x2 + α22x + α91"
    )
}

#[test]
fn generator_polynomial_88() {
    let poly = crate::generator_polynomial::generator(88);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x88 + α150x87 + α13x86 + α34x85 + α107x84 + α13x83 + α139x82 + α92x81 + α59x80 + α115x79 + α22x78 + α254x77 + α111x76 + α137x75 + α125x74 + α209x73 + α60x72 + α203x71 + α89x70 + α79x69 + α186x68 + α213x67 + α215x66 + α71x65 + α2x64 + α95x63 + α232x62 + α244x61 + α9x60 + α243x59 + α33x58 + α125x57 + α204x56 + α97x55 + α57x54 + α12x53 + α224x52 + α222x51 + α58x50 + α247x49 + α144x48 + α25x47 + α147x46 + α205x45 + α64x44 + α37x43 + α66x42 + α31x41 + α237x40 + α172x39 + α70x38 + α66x37 + α155x36 + α30x35 + α162x34 + α34x33 + α228x32 + α236x31 + α231x30 + α18x29 + α126x28 + α193x27 + α13x26 + α218x25 + α212x24 + α113x23 + α89x22 + α174x21 + α234x20 + α214x19 + α56x18 + α2x17 + α201x16 + α182x15 + α185x14 + α29x13 + α90x12 + α65x11 + α175x10 + α100x9 + α131x8 + α251x7 + α130x6 + α91x5 + α17x4 + α31x3 + α97x2 + α66x + α3"
    )
}

#[test]
fn generator_polynomial_249() {
    let poly = crate::generator_polynomial::generator(249);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x249 + α160x248 + α216x247 + α187x246 + α201x245 + α78x244 + α126x243 + α135x242 + α28x241 + α126x240 + α132x239 + α26x238 + α216x237 + α96x236 + α213x235 + α216x234 + α75x233 + α236x232 + α186x231 + α87x230 + α40x229 + α222x228 + α85x227 + α76x226 + α252x225 + α56x224 + α152x223 + α77x222 + α148x221 + α97x220 + α57x219 + α231x218 + α114x217 + α22x216 + α241x215 + α32x214 + α213x213 + α48x212 + α234x211 + α82x210 + α23x209 + α252x208 + α72x207 + α198x206 + α174x205 + α139x204 + α234x203 + α13x202 + α156x201 + α161x200 + α216x199 + α103x198 + α39x197 + α248x196 + α116x195 + α179x194 + α228x193 + α229x192 + α171x191 + α153x190 + α177x189 + α15x188 + α135x187 + α91x186 + α145x185 + α41x184 + α114x183 + α87x182 + α45x181 + α12x180 + α141x179 + α139x178 + α166x177 + α136x176 + α201x175 + α164x174 + α205x173 + α30x172 + α124x171 + α239x170 + α235x169 + α56x168 + α158x167 + α15x166 + α172x165 + α58x164 + α19x163 + α120x162 + α97x161 + α90x160 + α198x159 + α234x158 + α144x157 + α119x156 + α179x155 + α1x154 + α46x153 + α71x152 + α0x151 + α8x150 + α246x149 + α232x148 + α63x147 + α144x146 + α182x145 + α54x144 + α0x143 + α198x142 + α107x141 + α196x140 + α52x139 + α14x138 + α123x137 + α205x136 + α186x135 + α201x134 + α24x133 + α13x132 + α26x131 + α47x130 + α226x129 + α32x128 + α176x127 + α127x126 + α180x125 + α49x124 + α244x123 + α31x122 + α135x121 + α67x120 + α136x119 + α108x118 + α88x117 + α92x116 + α7x115 + α240x114 + α252x113 + α163x112 + α47x111 + α78x110 + α215x109 + α119x108 + α203x107 + α253x106 + α45x105 + α166x104 + α121x103 + α33x102 + α195x101 + α202x100 + α212x99 + α197x98 + α6x97 + α229x96 + α177x95 + α93x94 + α26x93 + α44x92 + α127x91 + α84x90 + α224x89 + α224x88 + α240x87 + α132x86 + α164x85 + α16x84 + α107x83 + α243x82 + α134x81 + α51x80 + α48x79 + α181x78 + α80x77 + α248x76 + α200x75 + α230x74 + α158x73 + α181x72 + α147x71 + α142x70 + α6x69 + α32x68 + α67x67 + α87x66 + α7x65 + α104x64 + α43x63 + α80x62 + α208x61 + α108x60 + α77x59 + α88x58 + α139x57 + α131x56 + α75x55 + α5x54 + α130x53 + α169x52 + α226x51 + α77x50 + α15x49 + α3x48 + α108x47 + α67x46 + α220x45 + α248x44 + α10x43 + α132x42 + α50x41 + α69x40 + α121x39 + α11x38 + α73x37 + α231x36 + α43x35 + α245x34 + α19x33 + α104x32 + α214x31 + α33x30 + α66x29 + α110x28 + α32x27 + α100x26 + α252x25 + α186x24 + α3x23 + α5x22 + α135x21 + α201x20 + α241x19 + α78x18 + α121x17 + α208x16 + α87x15 + α77x14 + α208x13 + α66x12 + α124x11 + α223x10 + α210x9 + α105x8 + α205x7 + α189x6 + α134x5 + α250x4 + α229x3 + α251x2 + α188x + α21"
    )
}

#[test]
fn generator_polynomial_245() {
    let poly = crate::generator_polynomial::generator(245);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x245 + α241x244 + α171x243 + α65x242 + α54x241 + α130x240 + α217x239 + α240x238 + α98x237 + α208x236 + α14x235 + α56x234 + α184x233 + α55x232 + α17x231 + α228x230 + α74x229 + α194x228 + α48x227 + α139x226 + α13x225 + α59x224 + α114x223 + α198x222 + α204x221 + α74x220 + α153x219 + α9x218 + α240x217 + α233x216 + α8x215 + α37x214 + α149x213 + α144x212 + α119x211 + α37x210 + α88x209 + α36x208 + α198x207 + α80x206 + α183x205 + α18x204 + α226x203 + α236x202 + α158x201 + α70x200 + α241x199 + α6x198 + α81x197 + α236x196 + α51x195 + α190x194 + α225x193 + α158x192 + α250x191 + α247x190 + α13x189 + α205x188 + α49x187 + α229x186 + α217x185 + α85x184 + α94x183 + α224x182 + α125x181 + α56x180 + α215x179 + α102x178 + α48x177 + α120x176 + α220x175 + α14x174 + α224x173 + α37x172 + α236x171 + α67x170 + α114x169 + α118x168 + α63x167 + α54x166 + α79x165 + α226x164 + α111x163 + α63x162 + α171x161 + α193x160 + α117x159 + α191x158 + α196x157 + α122x156 + α63x155 + α103x154 + α121x153 + α174x152 + α36x151 + α132x150 + α119x149 + α213x148 + α122x147 + α5x146 + α62x145 + α131x144 + α146x143 + α69x142 + α108x141 + α16x140 + α210x139 + α101x138 + α52x137 + α135x136 + α152x135 + α160x134 + α186x133 + α217x132 + α224x131 + α151x130 + α121x129 + α99x128 + α192x127 + α169x126 + α134x125 + α150x124 + α79x123 + α201x122 + α6x121 + α234x120 + α3x119 + α15x118 + α166x117 + α177x116 + α196x115 + α3x114 + α240x113 + α198x112 + α161x111 + α142x110 + α114x109 + α20x108 + α58x107 + α156x106 + α206x105 + α32x104 + α237x103 + α48x102 + α22x101 + α197x100 + α129x99 + α235x98 + α60x97 + α210x96 + α212x95 + α105x94 + α232x93 + α168x92 + α139x91 + α88x90 + α136x89 + α199x88 + α183x87 + α98x86 + α163x85 + α130x84 + α11x83 + α48x82 + α152x81 + α249x80 + α213x79 + α211x78 + α0x77 + α240x76 + α182x75 + α85x74 + α130x73 + α51x72 + α85x71 + α25x70 + α169x69 + α86x68 + α129x67 + α231x66 + α61x65 + α119x64 + α207x63 + α66x62 + α46x61 + α167x60 + α168x59 + α232x58 + α122x57 + α174x56 + α142x55 + α134x54 + α31x53 + α87x52 + α41x51 + α146x50 + α65x49 + α154x48 + α68x47 + α37x46 + α110x45 + α187x44 + α254x43 + α233x42 + α14x41 + α168x40 + α54x39 + α161x38 + α243x37 + α29x36 + α222x35 + α38x34 + α52x33 + α46x32 + α178x31 + α138x30 + α97x29 + α93x28 + α106x27 + α239x26 + α149x25 + α13x24 + α251x23 + α156x22 + α90x21 + α33x20 + α148x19 + α46x18 + α181x17 + α50x16 + α193x15 + α226x14 + α253x13 + α116x12 + α232x11 + α179x10 + α107x9 + α241x8 + α117x7 + α83x6 + α240x5 + α153x4 + α153x3 + α248x2 + α52x + α55"
    )
}

#[test]
fn generator_polynomial_151() {
    let poly = crate::generator_polynomial::generator(151);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x151 + α153x150 + α247x149 + α214x148 + α68x147 + α242x146 + α18x145 + α183x144 + α125x143 + α163x142 + α114x141 + α186x140 + α198x139 + α209x138 + α3x137 + α30x136 + α189x135 + α26x134 + α235x133 + α156x132 + α193x131 + α4x130 + α114x129 + α179x128 + α88x127 + α123x126 + α60x125 + α176x124 + α190x123 + α220x122 + α45x121 + α73x120 + α78x119 + α248x118 + α54x117 + α178x116 + α202x115 + α47x114 + α66x113 + α74x112 + α36x111 + α165x110 + α57x109 + α49x108 + α38x107 + α109x106 + α56x105 + α249x104 + α70x103 + α250x102 + α8x101 + α122x100 + α36x99 + α209x98 + α193x97 + α119x96 + α39x95 + α188x94 + α85x93 + α219x92 + α165x91 + α248x90 + α26x89 + α236x88 + α149x87 + α218x86 + α240x85 + α5x84 + α95x83 + α90x82 + α154x81 + α20x80 + α64x79 + α74x78 + α1x77 + α104x76 + α179x75 + α226x74 + α194x73 + α79x72 + α185x71 + α214x70 + α45x69 + α200x68 + α5x67 + α135x66 + α8x65 + α89x64 + α71x63 + α11x62 + α128x61 + α195x60 + α144x59 + α160x58 + α158x57 + α159x56 + α134x55 + α103x54 + α14x53 + α246x52 + α227x51 + α8x50 + α145x49 + α115x48 + α189x47 + α146x46 + α94x45 + α173x44 + α79x43 + α237x42 + α240x41 + α6x40 + α194x39 + α81x38 + α212x37 + α7x36 + α133x35 + α159x34 + α248x33 + α228x32 + α118x31 + α240x30 + α55x29 + α175x28 + α56x27 + α90x26 + α48x25 + α163x24 + α149x23 + α234x22 + α19x21 + α103x20 + α216x19 + α190x18 + α131x17 + α189x16 + α180x15 + α48x14 + α149x13 + α33x12 + α171x11 + α249x10 + α193x9 + α50x8 + α3x7 + α243x6 + α107x5 + α83x4 + α124x3 + α52x2 + α108x + α105"
    )
}

#[test]
fn generator_polynomial_95() {
    let poly = crate::generator_polynomial::generator(95);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x95 + α151x94 + α49x93 + α241x92 + α163x91 + α238x90 + α114x89 + α211x88 + α193x87 + α248x86 + α223x85 + α158x84 + α82x83 + α52x82 + α155x81 + α41x80 + α79x79 + α201x78 + α190x77 + α89x76 + α179x75 + α133x74 + α22x73 + α84x72 + α48x71 + α180x70 + α71x69 + α123x68 + α229x67 + α37x66 + α30x65 + α177x64 + α243x63 + α60x62 + α47x61 + α235x60 + α177x59 + α116x58 + α76x57 + α91x56 + α177x55 + α123x54 + α97x53 + α165x52 + α134x51 + α130x50 + α40x49 + α182x48 + α229x47 + α181x46 + α110x45 + α208x44 + α78x43 + α104x42 + α224x41 + α117x40 + α125x39 + α204x38 + α83x37 + α238x36 + α135x35 + α41x34 + α148x33 + α170x32 + α198x31 + α145x30 + α246x29 + α22x28 + α10x27 + α52x26 + α0x25 + α217x24 + α92x23 + α124x22 + α74x21 + α214x20 + α218x19 + α158x18 + α8x17 + α235x16 + α36x15 + α244x14 + α235x13 + α104x12 + α19x11 + α178x10 + α42x9 + α81x8 + α193x7 + α190x6 + α153x5 + α172x4 + α89x3 + α246x2 + α187x + α130"
    )
}

#[test]
fn generator_polynomial_49() {
    let poly = crate::generator_polynomial::generator(49);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x49 + α172x48 + α121x47 + α1x46 + α41x45 + α193x44 + α222x43 + α237x42 + α64x41 + α109x40 + α181x39 + α52x38 + α120x37 + α212x36 + α226x35 + α239x34 + α245x33 + α208x32 + α20x31 + α246x30 + α34x29 + α225x28 + α204x27 + α134x26 + α101x25 + α125x24 + α206x23 + α69x22 + α138x21 + α250x20 + α0x19 + α77x18 + α58x17 + α143x16 + α185x15 + α220x14 + α254x13 + α210x12 + α190x11 + α112x10 + α88x9 + α91x8 + α57x7 + α90x6 + α109x5 + α5x4 + α13x3 + α181x2 + α25x + α156"
    )
}

#[test]
fn generator_polynomial_98() {
    let poly = crate::generator_polynomial::generator(98);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x98 + α114x97 + α0x96 + α30x95 + α109x94 + α177x93 + α149x92 + α62x91 + α78x90 + α28x89 + α219x88 + α159x87 + α210x86 + α110x85 + α69x84 + α90x83 + α17x82 + α24x81 + α216x80 + α55x79 + α206x78 + α173x77 + α187x76 + α126x75 + α94x74 + α220x73 + α28x72 + α145x71 + α88x70 + α254x69 + α92x68 + α94x67 + α51x66 + α98x65 + α157x64 + α229x63 + α94x62 + α41x61 + α80x60 + α144x59 + α181x58 + α171x57 + α20x56 + α72x55 + α218x54 + α184x53 + α239x52 + α70x51 + α102x50 + α210x49 + α199x48 + α9x47 + α20x46 + α62x45 + α193x44 + α144x43 + α189x42 + α182x41 + α34x40 + α94x39 + α127x38 + α185x37 + α80x36 + α57x35 + α82x34 + α120x33 + α170x32 + α55x31 + α150x30 + α154x29 + α85x28 + α239x27 + α219x26 + α253x25 + α224x24 + α98x23 + α1x22 + α84x21 + α214x20 + α160x19 + α163x18 + α68x17 + α158x16 + α73x15 + α149x14 + α32x13 + α229x12 + α20x11 + α177x10 + α83x9 + α230x8 + α56x7 + α240x6 + α110x5 + α139x4 + α157x3 + α224x2 + α180x + α163"
    )
}

#[test]
fn generator_polynomial_143() {
    let poly = crate::generator_polynomial::generator(143);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x143 + α125x142 + α39x141 + α125x140 + α156x139 + α120x138 + α194x137 + α134x136 + α230x135 + α7x134 + α172x133 + α187x132 + α131x131 + α100x130 + α213x129 + α178x128 + α188x127 + α148x126 + α35x125 + α155x124 + α57x123 + α250x122 + α153x121 + α22x120 + α55x119 + α231x118 + α222x117 + α11x116 + α59x115 + α149x114 + α23x113 + α84x112 + α87x111 + α95x110 + α118x109 + α191x108 + α162x107 + α77x106 + α224x105 + α149x104 + α131x103 + α88x102 + α75x101 + α43x100 + α130x99 + α156x98 + α203x97 + α83x96 + α128x95 + α155x94 + α149x93 + α119x92 + α48x91 + α162x90 + α69x89 + α8x88 + α107x87 + α247x86 + α184x85 + α75x84 + α42x83 + α228x82 + α3x81 + α170x80 + α76x79 + α152x78 + α144x77 + α222x76 + α130x75 + α12x74 + α120x73 + α62x72 + α133x71 + α78x70 + α112x69 + α117x68 + α96x67 + α160x66 + α55x65 + α121x64 + α102x63 + α77x62 + α189x61 + α145x60 + α65x59 + α61x58 + α11x57 + α13x56 + α56x55 + α4x54 + α239x53 + α12x52 + α225x51 + α142x50 + α35x49 + α150x48 + α247x47 + α254x46 + α94x45 + α210x44 + α10x43 + α184x42 + α84x41 + α14x40 + α174x39 + α136x38 + α131x37 + α103x36 + α19x35 + α88x34 + α207x33 + α86x32 + α225x31 + α51x30 + α64x29 + α116x28 + α210x27 + α53x26 + α204x25 + α170x24 + α24x23 + α42x22 + α26x21 + α230x20 + α215x19 + α237x18 + α237x17 + α164x16 + α41x15 + α218x14 + α247x13 + α165x12 + α108x11 + α235x10 + α212x9 + α67x8 + α113x7 + α60x6 + α128x5 + α51x4 + α162x3 + α218x2 + α191x + α208"
    )
}

#[test]
fn generator_polynomial_148() {
    let poly = crate::generator_polynomial::generator(148);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x148 + α181x147 + α185x146 + α181x145 + α100x144 + α101x143 + α65x142 + α177x141 + α36x140 + α52x139 + α138x138 + α163x137 + α93x136 + α40x135 + α228x134 + α131x133 + α251x132 + α4x131 + α92x130 + α87x129 + α48x128 + α198x127 + α251x126 + α187x125 + α150x124 + α98x123 + α108x122 + α147x121 + α24x120 + α135x119 + α251x118 + α145x117 + α8x116 + α239x115 + α124x114 + α37x113 + α178x112 + α42x111 + α141x110 + α199x109 + α225x108 + α14x107 + α93x106 + α53x105 + α129x104 + α169x103 + α151x102 + α62x101 + α158x100 + α13x99 + α73x98 + α24x97 + α124x96 + α25x95 + α46x94 + α239x93 + α66x92 + α58x91 + α217x90 + α0x89 + α130x88 + α179x87 + α62x86 + α56x85 + α219x84 + α161x83 + α253x82 + α162x81 + α117x80 + α223x79 + α147x78 + α65x77 + α169x76 + α118x75 + α32x74 + α10x73 + α208x72 + α251x71 + α225x70 + α193x69 + α234x68 + α171x67 + α154x66 + α209x65 + α159x64 + α143x63 + α41x62 + α50x61 + α148x60 + α165x59 + α19x58 + α7x57 + α162x56 + α227x55 + α181x54 + α52x53 + α43x52 + α90x51 + α31x50 + α118x49 + α155x48 + α206x47 + α187x46 + α97x45 + α204x44 + α20x43 + α207x42 + α20x41 + α123x40 + α244x39 + α78x38 + α126x37 + α154x36 + α160x35 + α139x34 + α146x33 + α62x32 + α91x31 + α89x30 + α120x29 + α156x28 + α171x27 + α24x26 + α161x25 + α105x24 + α34x23 + α245x22 + α84x21 + α81x20 + α12x19 + α164x18 + α223x17 + α107x16 + α134x15 + α123x14 + α82x13 + α27x12 + α244x11 + α111x10 + α172x9 + α48x8 + α81x7 + α116x6 + α44x5 + α190x4 + α163x3 + α59x2 + α202x + α168"
    )
}

#[test]
fn generator_polynomial_178() {
    let poly = crate::generator_polynomial::generator(178);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x178 + α126x177 + α211x176 + α85x175 + α76x174 + α21x173 + α67x172 + α190x171 + α208x170 + α181x169 + α70x168 + α170x167 + α141x166 + α168x165 + α184x164 + α28x163 + α80x162 + α93x161 + α233x160 + α240x159 + α117x158 + α220x157 + α47x156 + α42x155 + α225x154 + α194x153 + α140x152 + α33x151 + α45x150 + α35x149 + α186x148 + α122x147 + α171x146 + α150x145 + α63x144 + α200x143 + α160x142 + α235x141 + α140x140 + α200x139 + α253x138 + α141x137 + α208x136 + α163x135 + α135x134 + α70x133 + α228x132 + α233x131 + α83x130 + α3x129 + α34x128 + α241x127 + α163x126 + α178x125 + α217x124 + α133x123 + α240x122 + α75x121 + α68x120 + α53x119 + α133x118 + α171x117 + α9x116 + α230x115 + α211x114 + α24x113 + α135x112 + α247x111 + α33x110 + α97x109 + α173x108 + α40x107 + α229x106 + α104x105 + α67x104 + α224x103 + α5x102 + α74x101 + α241x100 + α149x99 + α73x98 + α132x97 + α89x96 + α110x95 + α74x94 + α190x93 + α191x92 + α129x91 + α250x90 + α197x89 + α172x88 + α228x87 + α212x86 + α133x85 + α194x84 + α152x83 + α53x82 + α18x81 + α136x80 + α134x79 + α148x78 + α158x77 + α11x76 + α152x75 + α172x74 + α131x73 + α178x72 + α166x71 + α221x70 + α67x69 + α180x68 + α61x67 + α126x66 + α192x65 + α46x64 + α242x63 + α198x62 + α27x61 + α166x60 + α8x59 + α200x58 + α129x57 + α216x56 + α31x55 + α37x54 + α175x53 + α82x52 + α82x51 + α52x50 + α198x49 + α200x48 + α17x47 + α189x46 + α208x45 + α195x44 + α145x43 + α112x42 + α222x41 + α1x40 + α125x39 + α242x38 + α4x37 + α106x36 + α68x35 + α108x34 + α117x33 + α60x32 + α188x31 + α174x30 + α200x29 + α132x28 + α42x27 + α71x26 + α47x25 + α0x24 + α249x23 + α176x22 + α16x21 + α90x20 + α135x19 + α50x18 + α87x17 + α251x16 + α121x15 + α199x14 + α105x13 + α0x12 + α206x11 + α28x10 + α61x9 + α10x8 + α169x7 + α223x6 + α99x5 + α76x4 + α7x3 + α55x2 + α147x + α198"
    )
}

#[test]
fn generator_polynomial_182() {
    let poly = crate::generator_polynomial::generator(182);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x182 + α138x181 + α118x180 + α21x179 + α216x178 + α233x177 + α181x176 + α170x175 + α65x174 + α32x173 + α252x172 + α246x171 + α86x170 + α84x169 + α29x168 + α90x167 + α47x166 + α109x165 + α113x164 + α157x163 + α61x162 + α136x161 + α30x160 + α192x159 + α116x158 + α232x157 + α100x156 + α191x155 + α184x154 + α232x153 + α59x152 + α15x151 + α189x150 + α94x149 + α179x148 + α132x147 + α250x146 + α69x145 + α193x144 + α5x143 + α110x142 + α211x141 + α29x140 + α78x139 + α4x138 + α22x137 + α231x136 + α210x135 + α148x134 + α176x133 + α218x132 + α90x131 + α56x130 + α30x129 + α114x128 + α245x127 + α181x126 + α9x125 + α153x124 + α54x123 + α164x122 + α155x121 + α169x120 + α185x119 + α76x118 + α142x117 + α44x116 + α108x115 + α146x114 + α250x113 + α76x112 + α44x111 + α166x110 + α128x109 + α169x108 + α205x107 + α225x106 + α112x105 + α225x104 + α156x103 + α141x102 + α27x101 + α96x100 + α125x99 + α181x98 + α234x97 + α12x96 + α182x95 + α15x94 + α102x93 + α32x92 + α187x91 + α213x90 + α209x89 + α48x88 + α141x87 + α152x86 + α45x85 + α173x84 + α43x83 + α195x82 + α52x81 + α92x80 + α33x79 + α28x78 + α96x77 + α135x76 + α41x75 + α186x74 + α71x73 + α35x72 + α94x71 + α52x70 + α152x69 + α229x68 + α117x67 + α234x66 + α3x65 + α118x64 + α153x63 + α63x62 + α230x61 + α165x60 + α236x59 + α6x58 + α43x57 + α141x56 + α131x55 + α181x54 + α23x53 + α230x52 + α190x51 + α244x50 + α128x49 + α26x48 + α14x47 + α216x46 + α188x45 + α96x44 + α96x43 + α228x42 + α81x41 + α161x40 + α237x39 + α96x38 + α153x37 + α5x36 + α68x35 + α41x34 + α137x33 + α158x32 + α165x31 + α135x30 + α234x29 + α112x28 + α45x27 + α135x26 + α193x25 + α3x24 + α5x23 + α24x22 + α56x21 + α162x20 + α184x19 + α66x18 + α243x17 + α107x16 + α76x15 + α196x14 + α177x13 + α105x12 + α191x11 + α123x10 + α84x9 + α43x8 + α74x7 + α11x6 + α244x5 + α153x4 + α139x3 + α162x2 + α108x + α151"
    )
}

#[test]
fn generator_polynomial_152() {
    let poly = crate::generator_polynomial::generator(152);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x152 + α201x151 + α75x150 + α252x149 + α88x148 + α160x147 + α27x146 + α138x145 + α216x144 + α239x143 + α122x142 + α105x141 + α41x140 + α82x139 + α224x138 + α210x137 + α126x136 + α108x135 + α29x134 + α132x133 + α104x132 + α174x131 + α16x130 + α166x129 + α174x128 + α82x127 + α176x126 + α208x125 + α236x124 + α8x123 + α154x122 + α1x121 + α40x120 + α66x119 + α116x118 + α27x117 + α214x116 + α30x115 + α126x114 + α224x113 + α0x112 + α145x111 + α157x110 + α204x109 + α103x108 + α22x107 + α243x106 + α227x105 + α14x104 + α147x103 + α13x102 + α46x101 + α3x100 + α167x99 + α25x98 + α155x97 + α14x96 + α238x95 + α109x94 + α32x93 + α117x92 + α10x91 + α190x90 + α4x89 + α200x88 + α22x87 + α224x86 + α61x85 + α26x84 + α4x83 + α66x82 + α86x81 + α122x80 + α126x79 + α15x78 + α102x77 + α37x76 + α253x75 + α62x74 + α69x73 + α216x72 + α76x71 + α207x70 + α41x69 + α214x68 + α145x67 + α204x66 + α153x65 + α227x64 + α182x63 + α9x62 + α235x61 + α238x60 + α49x59 + α22x58 + α47x57 + α229x56 + α11x55 + α32x54 + α70x53 + α57x52 + α251x51 + α114x50 + α144x49 + α162x48 + α16x47 + α183x46 + α113x45 + α90x44 + α87x43 + α191x42 + α75x41 + α81x40 + α201x39 + α254x38 + α54x37 + α134x36 + α98x35 + α83x34 + α184x33 + α54x32 + α166x31 + α215x30 + α220x29 + α89x28 + α212x27 + α76x26 + α133x25 + α121x24 + α9x23 + α10x22 + α64x21 + α145x20 + α69x19 + α117x18 + α92x17 + α6x16 + α241x15 + α151x14 + α160x13 + α15x12 + α230x11 + α143x10 + α156x9 + α29x8 + α102x7 + α142x6 + α171x5 + α250x4 + α55x3 + α29x2 + α51x + α1"
    )
}

#[test]
fn generator_polynomial_150() {
    let poly = crate::generator_polynomial::generator(150);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x150 + α118x149 + α2x148 + α242x147 + α198x146 + α26x145 + α111x144 + α140x143 + α97x142 + α203x141 + α243x140 + α136x139 + α118x138 + α36x137 + α126x136 + α141x135 + α155x134 + α25x133 + α52x132 + α38x131 + α71x130 + α150x129 + α175x128 + α141x127 + α177x126 + α55x125 + α76x124 + α178x123 + α195x122 + α159x121 + α165x120 + α159x119 + α53x118 + α234x117 + α253x116 + α214x115 + α12x114 + α35x113 + α219x112 + α158x111 + α104x110 + α113x109 + α205x108 + α32x107 + α173x106 + α225x105 + α126x104 + α98x103 + α221x102 + α38x101 + α132x100 + α203x99 + α126x98 + α170x97 + α205x96 + α192x95 + α37x94 + α212x93 + α65x92 + α60x91 + α196x90 + α132x89 + α51x88 + α233x87 + α138x86 + α27x85 + α232x84 + α122x83 + α229x82 + α226x81 + α136x80 + α10x79 + α60x78 + α108x77 + α51x76 + α39x75 + α200x74 + α151x73 + α252x72 + α96x71 + α116x70 + α100x69 + α252x68 + α39x67 + α43x66 + α242x65 + α247x64 + α236x63 + α203x62 + α178x61 + α136x60 + α149x59 + α48x58 + α89x57 + α63x56 + α112x55 + α19x54 + α133x53 + α238x52 + α209x51 + α32x50 + α87x49 + α164x48 + α190x47 + α112x46 + α105x45 + α202x44 + α210x43 + α22x42 + α79x41 + α219x40 + α167x39 + α122x38 + α87x37 + α213x36 + α54x35 + α242x34 + α117x33 + α85x32 + α85x31 + α240x30 + α128x29 + α58x28 + α190x27 + α237x26 + α110x25 + α126x24 + α239x23 + α167x22 + α36x21 + α106x20 + α222x19 + α130x18 + α252x17 + α21x16 + α156x15 + α35x14 + α94x13 + α70x12 + α237x11 + α238x10 + α92x9 + α135x8 + α72x7 + α192x6 + α1x5 + α67x4 + α5x3 + α169x2 + α179x + α210"
    )
}

#[test]
fn generator_polynomial_80() {
    let poly = crate::generator_polynomial::generator(80);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x80 + α143x79 + α13x78 + α4x77 + α135x76 + α114x75 + α127x74 + α124x73 + α167x72 + α250x71 + α92x70 + α176x69 + α190x68 + α120x67 + α125x66 + α136x65 + α168x64 + α186x63 + α18x62 + α34x61 + α197x60 + α84x59 + α207x58 + α140x57 + α247x56 + α146x55 + α36x54 + α166x53 + α147x52 + α135x51 + α81x50 + α68x49 + α6x48 + α21x47 + α19x46 + α158x45 + α254x44 + α71x43 + α45x42 + α252x41 + α109x40 + α76x39 + α203x38 + α53x37 + α60x36 + α43x35 + α238x34 + α64x33 + α128x32 + α14x31 + α106x30 + α239x29 + α75x28 + α173x27 + α122x26 + α56x25 + α236x24 + α208x23 + α99x22 + α55x21 + α247x20 + α163x19 + α226x18 + α218x17 + α24x16 + α71x15 + α139x14 + α213x13 + α107x12 + α172x11 + α167x10 + α149x9 + α145x8 + α181x7 + α8x6 + α74x5 + α174x4 + α122x3 + α210x2 + α164x + α100"
    )
}

#[test]
fn generator_polynomial_38() {
    let poly = crate::generator_polynomial::generator(38);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x38 + α159x37 + α34x36 + α38x35 + α228x34 + α230x33 + α59x32 + α243x31 + α95x30 + α49x29 + α218x28 + α176x27 + α164x26 + α20x25 + α65x24 + α45x23 + α111x22 + α39x21 + α81x20 + α49x19 + α118x18 + α113x17 + α222x16 + α193x15 + α250x14 + α242x13 + α168x12 + α217x11 + α41x10 + α164x9 + α247x8 + α177x7 + α30x6 + α238x5 + α18x4 + α120x3 + α153x2 + α60x + α193"
    )
}

#[test]
fn generator_polynomial_242() {
    let poly = crate::generator_polynomial::generator(242);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x242 + α61x241 + α222x240 + α19x239 + α51x238 + α223x237 + α4x236 + α226x235 + α55x234 + α187x233 + α133x232 + α71x231 + α185x230 + α74x229 + α35x228 + α93x227 + α128x226 + α228x225 + α41x224 + α236x223 + α216x222 + α208x221 + α96x220 + α174x219 + α132x218 + α42x217 + α15x216 + α4x215 + α137x214 + α100x213 + α41x212 + α104x211 + α16x210 + α19x209 + α7x208 + α63x207 + α78x206 + α83x205 + α143x204 + α7x203 + α51x202 + α28x201 + α203x200 + α132x199 + α35x198 + α74x197 + α31x196 + α254x195 + α120x194 + α96x193 + α171x192 + α230x191 + α146x190 + α148x189 + α212x188 + α97x187 + α225x186 + α4x185 + α203x184 + α217x183 + α12x182 + α49x181 + α49x180 + α180x179 + α210x178 + α8x177 + α177x176 + α122x175 + α5x174 + α22x173 + α4x172 + α194x171 + α26x170 + α202x169 + α73x168 + α28x167 + α77x166 + α39x165 + α131x164 + α153x163 + α246x162 + α231x161 + α106x160 + α212x159 + α155x158 + α162x157 + α46x156 + α134x155 + α205x154 + α36x153 + α182x152 + α34x151 + α29x150 + α106x149 + α185x148 + α54x147 + α206x146 + α74x145 + α48x144 + α13x143 + α3x142 + α19x141 + α206x140 + α107x139 + α26x138 + α142x137 + α254x136 + α81x135 + α171x134 + α130x133 + α108x132 + α32x131 + α192x130 + α42x129 + α228x128 + α239x127 + α152x126 + α1x125 + α148x124 + α38x123 + α76x122 + α15x121 + α62x120 + α10x119 + α106x118 + α200x117 + α82x116 + α155x115 + α130x114 + α185x113 + α66x112 + α147x111 + α209x110 + α217x109 + α244x108 + α140x107 + α44x106 + α173x105 + α43x104 + α110x103 + α195x102 + α249x101 + α219x100 + α215x99 + α236x98 + α248x97 + α111x96 + α200x95 + α62x94 + α224x93 + α133x92 + α124x91 + α3x90 + α98x89 + α253x88 + α168x87 + α66x86 + α168x85 + α147x84 + α190x83 + α70x82 + α181x81 + α182x80 + α75x79 + α39x78 + α188x77 + α212x76 + α149x75 + α180x74 + α40x73 + α105x72 + α4x71 + α55x70 + α59x69 + α28x68 + α131x67 + α172x66 + α244x65 + α177x64 + α133x63 + α243x62 + α229x61 + α178x60 + α114x59 + α86x58 + α128x57 + α80x56 + α193x55 + α39x54 + α216x53 + α200x52 + α15x51 + α197x50 + α108x49 + α118x48 + α238x47 + α1x46 + α30x45 + α232x44 + α60x43 + α117x42 + α183x41 + α192x40 + α134x39 + α1x38 + α182x37 + α163x36 + α134x35 + α64x34 + α62x33 + α45x32 + α119x31 + α42x30 + α87x29 + α110x28 + α218x27 + α215x26 + α228x25 + α49x24 + α77x23 + α240x22 + α83x21 + α77x20 + α83x19 + α129x18 + α47x17 + α188x16 + α139x15 + α67x14 + α92x13 + α189x12 + α61x11 + α109x10 + α149x9 + α3x8 + α160x7 + α179x6 + α129x5 + α198x4 + α152x3 + α86x2 + α166x + α91"
    )
}

#[test]
fn generator_polynomial_192() {
    let poly = crate::generator_polynomial::generator(192);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x192 + α222x191 + α179x190 + α55x189 + α177x188 + α192x187 + α210x186 + α165x185 + α221x184 + α147x183 + α3x182 + α186x181 + α99x180 + α136x179 + α217x178 + α94x177 + α98x176 + α141x175 + α6x174 + α11x173 + α220x172 + α204x171 + α201x170 + α112x169 + α37x168 + α140x167 + α54x166 + α90x165 + α151x164 + α116x163 + α6x162 + α56x161 + α160x160 + α3x159 + α55x158 + α150x157 + α1x156 + α27x155 + α39x154 + α172x153 + α246x152 + α100x151 + α44x150 + α108x149 + α124x148 + α88x147 + α49x146 + α211x145 + α21x144 + α7x143 + α204x142 + α234x141 + α196x140 + α229x139 + α172x138 + α168x137 + α138x136 + α145x135 + α239x134 + α137x133 + α59x132 + α248x131 + α20x130 + α96x129 + α73x128 + α115x127 + α162x126 + α122x125 + α111x124 + α229x123 + α162x122 + α240x121 + α159x120 + α4x119 + α127x118 + α166x117 + α250x116 + α57x115 + α165x114 + α235x113 + α222x112 + α149x111 + α162x110 + α58x109 + α172x108 + α247x107 + α148x106 + α106x105 + α11x104 + α178x103 + α24x102 + α126x101 + α245x100 + α183x99 + α87x98 + α144x97 + α178x96 + α80x95 + α214x94 + α246x93 + α244x92 + α61x91 + α150x90 + α240x89 + α9x88 + α40x87 + α18x86 + α53x85 + α169x84 + α246x83 + α31x82 + α209x81 + α218x80 + α167x79 + α33x78 + α116x77 + α245x76 + α97x75 + α249x74 + α62x73 + α153x72 + α170x71 + α28x70 + α31x69 + α104x68 + α51x67 + α27x66 + α171x65 + α65x64 + α24x63 + α139x62 + α48x61 + α50x60 + α64x59 + α102x58 + α199x57 + α128x56 + α94x55 + α34x54 + α27x53 + α185x52 + α159x51 + α65x50 + α59x49 + α9x48 + α135x47 + α164x46 + α139x45 + α111x44 + α31x43 + α158x42 + α150x41 + α232x40 + α94x39 + α152x38 + α76x37 + α241x36 + α71x35 + α167x34 + α51x33 + α144x32 + α231x31 + α117x30 + α163x29 + α134x28 + α9x27 + α164x26 + α186x25 + α19x24 + α30x23 + α55x22 + α249x21 + α201x20 + α183x19 + α114x18 + α185x17 + α78x16 + α10x15 + α69x14 + α179x13 + α78x12 + α101x11 + α109x10 + α189x9 + α199x8 + α79x7 + α60x6 + α233x5 + α154x4 + α223x3 + α28x2 + α7x + α231"
    )
}

#[test]
fn generator_polynomial_60() {
    let poly = crate::generator_polynomial::generator(60);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x60 + α107x59 + α140x58 + α26x57 + α12x56 + α9x55 + α141x54 + α243x53 + α197x52 + α226x51 + α197x50 + α219x49 + α45x48 + α211x47 + α101x46 + α219x45 + α120x44 + α28x43 + α181x42 + α127x41 + α6x40 + α100x39 + α247x38 + α2x37 + α205x36 + α198x35 + α57x34 + α115x33 + α219x32 + α101x31 + α109x30 + α160x29 + α82x28 + α37x27 + α38x26 + α238x25 + α49x24 + α160x23 + α209x22 + α121x21 + α86x20 + α11x19 + α124x18 + α30x17 + α181x16 + α84x15 + α25x14 + α194x13 + α87x12 + α65x11 + α102x10 + α190x9 + α220x8 + α70x7 + α27x6 + α209x5 + α16x4 + α89x3 + α7x2 + α33x + α240"
    )
}

#[test]
fn generator_polynomial_104() {
    let poly = crate::generator_polynomial::generator(104);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x104 + α2x103 + α27x102 + α27x101 + α232x100 + α102x99 + α184x98 + α217x97 + α214x96 + α98x95 + α7x94 + α229x93 + α16x92 + α203x91 + α201x90 + α244x89 + α62x88 + α185x87 + α129x86 + α42x85 + α189x84 + α239x83 + α82x82 + α222x81 + α151x80 + α87x79 + α88x78 + α222x77 + α29x76 + α244x75 + α151x74 + α239x73 + α216x72 + α173x71 + α179x70 + α245x69 + α185x68 + α59x67 + α128x66 + α90x65 + α207x64 + α160x63 + α236x62 + α247x61 + α6x60 + α151x59 + α141x58 + α193x57 + α70x56 + α52x55 + α162x54 + α182x53 + α239x52 + α30x51 + α113x50 + α106x49 + α227x48 + α198x47 + α249x46 + α107x45 + α65x44 + α154x43 + α246x42 + α18x41 + α168x40 + α154x39 + α40x38 + α74x37 + α48x36 + α211x35 + α248x34 + α90x33 + α236x32 + α107x31 + α122x30 + α63x29 + α206x28 + α247x27 + α216x26 + α63x25 + α230x24 + α149x23 + α112x22 + α117x21 + α170x20 + α126x19 + α61x18 + α220x17 + α200x16 + α230x15 + α35x14 + α140x13 + α56x12 + α117x11 + α253x10 + α192x9 + α156x8 + α7x7 + α77x6 + α98x5 + α76x4 + α229x3 + α77x2 + α155x + α1"
    )
}

#[test]
fn generator_polynomial_199() {
    let poly = crate::generator_polynomial::generator(199);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x199 + α50x198 + α27x197 + α110x196 + α36x195 + α229x194 + α168x193 + α90x192 + α144x191 + α38x190 + α123x189 + α107x188 + α140x187 + α2x186 + α107x185 + α82x184 + α245x183 + α61x182 + α1x181 + α211x180 + α57x179 + α104x178 + α41x177 + α1x176 + α120x175 + α231x174 + α137x173 + α36x172 + α99x171 + α157x170 + α205x169 + α91x168 + α167x167 + α16x166 + α27x165 + α1x164 + α184x163 + α223x162 + α141x161 + α181x160 + α217x159 + α0x158 + α114x157 + α76x156 + α73x155 + α245x154 + α99x153 + α163x152 + α183x151 + α212x150 + α147x149 + α147x148 + α8x147 + α221x146 + α28x145 + α35x144 + α94x143 + α217x142 + α130x141 + α158x140 + α213x139 + α185x138 + α161x137 + α214x136 + α241x135 + α32x134 + α244x133 + α89x132 + α199x131 + α193x130 + α12x129 + α212x128 + α228x127 + α76x126 + α156x125 + α225x124 + α112x123 + α143x122 + α125x121 + α72x120 + α247x119 + α65x118 + α251x117 + α143x116 + α145x115 + α47x114 + α56x113 + α51x112 + α225x111 + α101x110 + α254x109 + α206x108 + α184x107 + α176x106 + α106x105 + α17x104 + α143x103 + α123x102 + α47x101 + α179x100 + α23x99 + α89x98 + α108x97 + α71x96 + α143x95 + α175x94 + α188x93 + α139x92 + α104x91 + α95x90 + α140x89 + α207x88 + α231x87 + α179x86 + α113x85 + α154x84 + α95x83 + α146x82 + α158x81 + α28x80 + α51x79 + α47x78 + α8x77 + α175x76 + α231x75 + α105x74 + α223x73 + α63x72 + α245x71 + α243x70 + α112x69 + α61x68 + α149x67 + α247x66 + α233x65 + α130x64 + α46x63 + α191x62 + α158x61 + α129x60 + α17x59 + α187x58 + α217x57 + α37x56 + α176x55 + α112x54 + α248x53 + α233x52 + α60x51 + α3x50 + α11x49 + α180x48 + α103x47 + α237x46 + α71x45 + α97x44 + α43x43 + α24x42 + α108x41 + α13x40 + α175x39 + α78x38 + α103x37 + α7x36 + α22x35 + α246x34 + α178x33 + α17x32 + α139x31 + α196x30 + α91x29 + α231x28 + α111x27 + α155x26 + α192x25 + α24x24 + α103x23 + α86x22 + α92x21 + α243x20 + α85x19 + α73x18 + α76x17 + α203x16 + α238x15 + α206x14 + α44x13 + α125x12 + α35x11 + α249x10 + α107x9 + α156x8 + α45x7 + α66x6 + α70x5 + α75x4 + α92x3 + α207x2 + α173x + α66"
    )
}

#[test]
fn generator_polynomial_184() {
    let poly = crate::generator_polynomial::generator(184);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x184 + α13x183 + α87x182 + α29x181 + α216x180 + α206x179 + α57x178 + α102x177 + α43x176 + α26x175 + α102x174 + α201x173 + α62x172 + α204x171 + α204x170 + α15x169 + α41x168 + α69x167 + α188x166 + α228x165 + α177x164 + α50x163 + α18x162 + α164x161 + α41x160 + α145x159 + α127x158 + α142x157 + α17x156 + α33x155 + α155x154 + α86x153 + α201x152 + α189x151 + α9x150 + α154x149 + α152x148 + α215x147 + α121x146 + α15x145 + α241x144 + α4x143 + α175x142 + α59x141 + α194x140 + α80x139 + α86x138 + α36x137 + α131x136 + α16x135 + α207x134 + α196x133 + α101x132 + α66x131 + α222x130 + α27x129 + α190x128 + α48x127 + α10x126 + α96x125 + α217x124 + α16x123 + α170x122 + α39x121 + α75x120 + α241x119 + α174x118 + α188x117 + α105x116 + α2x115 + α250x114 + α122x113 + α74x112 + α172x111 + α133x110 + α134x109 + α167x108 + α176x107 + α99x106 + α42x105 + α201x104 + α148x103 + α244x102 + α235x101 + α70x100 + α243x99 + α99x98 + α157x97 + α4x96 + α140x95 + α88x94 + α171x93 + α146x92 + α99x91 + α199x90 + α179x89 + α226x88 + α52x87 + α177x86 + α249x85 + α4x84 + α97x83 + α34x82 + α121x81 + α102x80 + α126x79 + α111x78 + α116x77 + α35x76 + α185x75 + α112x74 + α79x73 + α164x72 + α140x71 + α196x70 + α131x69 + α162x68 + α173x67 + α87x66 + α82x65 + α99x64 + α246x63 + α50x62 + α79x61 + α208x60 + α15x59 + α112x58 + α78x57 + α148x56 + α168x55 + α36x54 + α63x53 + α26x52 + α49x51 + α243x50 + α235x49 + α23x48 + α111x47 + α89x46 + α11x45 + α53x44 + α101x43 + α145x42 + α157x41 + α67x40 + α24x39 + α58x38 + α80x37 + α200x36 + α130x35 + α168x34 + α21x33 + α216x32 + α29x31 + α26x30 + α87x29 + α254x28 + α52x27 + α220x26 + α166x25 + α245x24 + α41x23 + α78x22 + α38x21 + α93x20 + α72x19 + α215x18 + α24x17 + α179x16 + α81x15 + α198x14 + α126x13 + α167x12 + α234x11 + α63x10 + α170x9 + α115x8 + α102x7 + α240x6 + α62x5 + α0x4 + α251x3 + α237x2 + α91x + α6"
    )
}

#[test]
fn generator_polynomial_18() {
    let poly = crate::generator_polynomial::generator(18);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x18 + α215x17 + α234x16 + α158x15 + α94x14 + α184x13 + α97x12 + α118x11 + α170x10 + α79x9 + α187x8 + α152x7 + α148x6 + α252x5 + α179x4 + α5x3 + α98x2 + α96x + α153"
    )
}

#[test]
fn generator_polynomial_53() {
    let poly = crate::generator_polynomial::generator(53);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x53 + α122x52 + α214x51 + α231x50 + α136x49 + α199x48 + α11x47 + α6x46 + α205x45 + α124x44 + α72x43 + α213x42 + α117x41 + α187x40 + α60x39 + α147x38 + α201x37 + α73x36 + α75x35 + α33x34 + α146x33 + α171x32 + α247x31 + α118x30 + α208x29 + α157x28 + α177x27 + α203x26 + α235x25 + α83x24 + α45x23 + α226x22 + α202x21 + α229x20 + α168x19 + α7x18 + α57x17 + α237x16 + α235x15 + α200x14 + α124x13 + α106x12 + α254x11 + α165x10 + α14x9 + α147x8 + α0x7 + α57x6 + α42x5 + α31x4 + α178x3 + α213x2 + α173x + α103"
    )
}

#[test]
fn generator_polynomial_89() {
    let poly = crate::generator_polynomial::generator(89);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x89 + α178x88 + α49x87 + α250x86 + α140x85 + α176x84 + α30x83 + α236x82 + α102x81 + α150x80 + α51x79 + α245x78 + α86x77 + α227x76 + α129x75 + α54x74 + α27x73 + α211x72 + α183x71 + α218x70 + α4x69 + α144x68 + α202x67 + α244x66 + α43x65 + α228x64 + α125x63 + α102x62 + α26x61 + α59x60 + α154x59 + α221x58 + α69x57 + α169x56 + α197x55 + α7x54 + α25x53 + α29x52 + α23x51 + α193x50 + α150x49 + α230x48 + α249x47 + α16x46 + α236x45 + α25x44 + α148x43 + α214x42 + α28x41 + α36x40 + α167x39 + α85x38 + α179x37 + α8x36 + α78x35 + α101x34 + α161x33 + α149x32 + α134x31 + α155x30 + α148x29 + α203x28 + α112x27 + α223x26 + α159x25 + α62x24 + α96x23 + α142x22 + α172x21 + α120x20 + α167x19 + α220x18 + α81x17 + α240x16 + α100x15 + α8x14 + α194x13 + α141x12 + α133x11 + α27x10 + α214x9 + α254x8 + α221x7 + α103x6 + α82x5 + α134x4 + α77x3 + α219x2 + α181x + α91"
    )
}

#[test]
fn generator_polynomial_123() {
    let poly = crate::generator_polynomial::generator(123);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x123 + α158x122 + α226x121 + α48x120 + α215x119 + α234x118 + α212x117 + α228x116 + α249x115 + α125x114 + α24x113 + α120x112 + α11x111 + α170x110 + α85x109 + α137x108 + α168x107 + α174x106 + α245x105 + α164x104 + α168x103 + α252x102 + α4x101 + α132x100 + α160x99 + α196x98 + α162x97 + α19x96 + α104x95 + α127x94 + α37x93 + α180x92 + α195x91 + α166x90 + α125x89 + α75x88 + α60x87 + α84x86 + α179x85 + α26x84 + α21x83 + α216x82 + α41x81 + α122x80 + α118x79 + α50x78 + α170x77 + α88x76 + α250x75 + α45x74 + α195x73 + α243x72 + α93x71 + α107x70 + α16x69 + α137x68 + α78x67 + α12x66 + α247x65 + α130x64 + α127x63 + α56x62 + α117x61 + α55x60 + α180x59 + α164x58 + α51x57 + α239x56 + α165x55 + α166x54 + α124x53 + α232x52 + α249x51 + α68x50 + α40x49 + α112x48 + α72x47 + α21x46 + α23x45 + α213x44 + α84x43 + α125x42 + α167x41 + α94x40 + α221x39 + α241x38 + α13x37 + α111x36 + α248x35 + α165x34 + α73x33 + α224x32 + α76x31 + α55x30 + α12x29 + α111x28 + α148x27 + α158x26 + α59x25 + α145x24 + α239x23 + α233x22 + α93x21 + α131x20 + α249x19 + α197x18 + α248x17 + α109x16 + α200x15 + α15x14 + α222x13 + α185x12 + α161x11 + α187x10 + α155x9 + α146x8 + α247x7 + α98x6 + α242x5 + α90x4 + α45x3 + α90x2 + α144x + α108"
    )
}

#[test]
fn generator_polynomial_84() {
    let poly = crate::generator_polynomial::generator(84);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x84 + α15x83 + α23x82 + α116x81 + α179x80 + α213x79 + α201x78 + α52x77 + α87x76 + α88x75 + α20x74 + α143x73 + α8x72 + α116x71 + α14x70 + α59x69 + α59x68 + α24x67 + α17x66 + α228x65 + α112x64 + α192x63 + α33x62 + α204x61 + α159x60 + α59x59 + α223x58 + α252x57 + α169x56 + α147x55 + α173x54 + α111x53 + α254x52 + α157x51 + α37x50 + α41x49 + α48x48 + α158x47 + α112x46 + α181x45 + α167x44 + α10x43 + α152x42 + α93x41 + α78x40 + α175x39 + α189x38 + α63x37 + α36x36 + α112x35 + α191x34 + α139x33 + α64x32 + α4x31 + α149x30 + α206x29 + α56x28 + α222x27 + α21x26 + α195x25 + α123x24 + α251x23 + α163x22 + α150x21 + α153x20 + α97x19 + α224x18 + α59x17 + α177x16 + α5x15 + α43x14 + α228x13 + α203x12 + α166x11 + α126x10 + α22x9 + α104x8 + α152x7 + α129x6 + α224x5 + α18x4 + α38x3 + α28x2 + α103x + α171"
    )
}

#[test]
fn generator_polynomial_127() {
    let poly = crate::generator_polynomial::generator(127);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x127 + α242x126 + α48x125 + α21x124 + α104x123 + α153x122 + α84x121 + α21x120 + α92x119 + α133x118 + α30x117 + α172x116 + α15x115 + α171x114 + α126x113 + α183x112 + α60x111 + α254x110 + α157x109 + α154x108 + α37x107 + α105x106 + α185x105 + α4x104 + α55x103 + α152x102 + α200x101 + α169x100 + α7x99 + α122x98 + α224x97 + α144x96 + α136x95 + α74x94 + α173x93 + α78x92 + α162x91 + α228x90 + α143x89 + α23x88 + α153x87 + α203x86 + α211x85 + α47x84 + α170x83 + α240x82 + α207x81 + α57x80 + α19x79 + α44x78 + α48x77 + α88x76 + α111x75 + α215x74 + α163x73 + α135x72 + α254x71 + α81x70 + α95x69 + α201x68 + α145x67 + α235x66 + α236x65 + α150x64 + α213x63 + α170x62 + α40x61 + α76x60 + α3x59 + α23x58 + α135x57 + α179x56 + α186x55 + α85x54 + α8x53 + α30x52 + α133x51 + α219x50 + α86x49 + α187x48 + α96x47 + α117x46 + α21x45 + α77x44 + α80x43 + α115x42 + α233x41 + α54x40 + α50x39 + α41x38 + α252x37 + α57x36 + α99x35 + α65x34 + α92x33 + α25x32 + α159x31 + α110x30 + α134x29 + α145x28 + α178x27 + α80x26 + α158x25 + α187x24 + α7x23 + α59x22 + α105x21 + α163x20 + α151x19 + α25x18 + α248x17 + α180x16 + α174x15 + α243x14 + α159x13 + α129x12 + α157x11 + α141x10 + α115x9 + α200x8 + α0x7 + α189x6 + α129x5 + α206x4 + α249x3 + α147x2 + α212x + α96"
    )
}

#[test]
fn generator_polynomial_15() {
    let poly = crate::generator_polynomial::generator(15);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x15 + α8x14 + α183x13 + α61x12 + α91x11 + α202x10 + α37x9 + α51x8 + α58x7 + α58x6 + α237x5 + α140x4 + α124x3 + α5x2 + α99x + α105"
    )
}

#[test]
fn generator_polynomial_114() {
    let poly = crate::generator_polynomial::generator(114);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x114 + α141x113 + α168x112 + α209x111 + α103x110 + α95x109 + α235x108 + α35x107 + α155x106 + α82x105 + α63x104 + α110x103 + α68x102 + α202x101 + α38x100 + α23x99 + α161x98 + α248x97 + α215x96 + α137x95 + α35x94 + α247x93 + α191x92 + α36x91 + α14x90 + α99x89 + α129x88 + α226x87 + α227x86 + α61x85 + α194x84 + α219x83 + α17x82 + α93x81 + α150x80 + α65x79 + α49x78 + α118x77 + α199x76 + α244x75 + α143x74 + α129x73 + α131x72 + α247x71 + α184x70 + α6x69 + α44x68 + α6x67 + α16x66 + α152x65 + α106x64 + α243x63 + α208x62 + α203x61 + α234x60 + α102x59 + α108x58 + α188x57 + α221x56 + α73x55 + α63x54 + α145x53 + α8x52 + α156x51 + α132x50 + α36x49 + α13x48 + α116x47 + α12x46 + α87x45 + α123x44 + α44x43 + α41x42 + α152x41 + α24x40 + α238x39 + α51x38 + α83x37 + α127x36 + α1x35 + α199x34 + α0x33 + α37x32 + α97x31 + α185x30 + α165x29 + α189x28 + α46x27 + α62x26 + α145x25 + α173x24 + α53x23 + α66x22 + α235x21 + α136x20 + α96x19 + α32x18 + α178x17 + α204x16 + α179x15 + α52x14 + α74x13 + α53x12 + α208x11 + α19x10 + α151x9 + α82x8 + α75x7 + α133x6 + α106x5 + α227x4 + α191x3 + α8x2 + α94x + α66"
    )
}

#[test]
fn generator_polynomial_170() {
    let poly = crate::generator_polynomial::generator(170);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x170 + α60x169 + α167x168 + α26x167 + α16x166 + α251x165 + α37x164 + α49x163 + α38x162 + α246x161 + α87x160 + α188x159 + α227x158 + α233x157 + α63x156 + α213x155 + α242x154 + α136x153 + α32x152 + α184x151 + α84x150 + α237x149 + α211x148 + α243x147 + α65x146 + α50x145 + α148x144 + α205x143 + α189x142 + α254x141 + α14x140 + α127x139 + α221x138 + α243x137 + α186x136 + α222x135 + α176x134 + α210x133 + α58x132 + α50x131 + α61x130 + α13x129 + α18x128 + α79x127 + α174x126 + α42x125 + α144x124 + α14x123 + α246x122 + α214x121 + α49x120 + α125x119 + α188x118 + α2x117 + α224x116 + α174x115 + α86x114 + α225x113 + α251x112 + α234x111 + α152x110 + α152x109 + α194x108 + α107x107 + α158x106 + α99x105 + α127x104 + α4x103 + α128x102 + α32x101 + α84x100 + α49x99 + α193x98 + α168x97 + α73x96 + α199x95 + α82x94 + α132x93 + α155x92 + α78x91 + α198x90 + α180x89 + α150x88 + α95x87 + α50x86 + α206x85 + α219x84 + α178x83 + α147x82 + α91x81 + α23x80 + α72x79 + α63x78 + α209x77 + α73x76 + α104x75 + α147x74 + α156x73 + α95x72 + α120x71 + α69x70 + α186x69 + α196x68 + α241x67 + α23x66 + α164x65 + α137x64 + α0x63 + α1x62 + α128x61 + α42x60 + α38x59 + α224x58 + α112x57 + α142x56 + α144x55 + α108x54 + α55x53 + α155x52 + α6x51 + α99x50 + α178x49 + α124x48 + α61x47 + α105x46 + α172x45 + α218x44 + α37x43 + α145x42 + α54x41 + α16x40 + α174x39 + α96x38 + α162x37 + α42x36 + α2x35 + α135x34 + α106x33 + α253x32 + α73x31 + α129x30 + α28x29 + α132x28 + α62x27 + α174x26 + α245x25 + α174x24 + α11x23 + α148x22 + α88x21 + α104x20 + α118x19 + α135x18 + α153x17 + α173x16 + α58x15 + α77x14 + α161x13 + α69x12 + α199x11 + α12x10 + α85x9 + α46x8 + α226x7 + α128x6 + α1x5 + α190x4 + α114x3 + α169x2 + α231x + α85"
    )
}

#[test]
fn generator_polynomial_207() {
    let poly = crate::generator_polynomial::generator(207);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x207 + α180x206 + α24x205 + α10x204 + α100x203 + α55x202 + α218x201 + α11x200 + α81x199 + α44x198 + α58x197 + α127x196 + α34x195 + α19x194 + α188x193 + α197x192 + α59x191 + α13x190 + α142x189 + α32x188 + α158x187 + α117x186 + α219x185 + α39x184 + α101x183 + α247x182 + α237x181 + α188x180 + α146x179 + α30x178 + α144x177 + α8x176 + α99x175 + α204x174 + α180x173 + α159x172 + α198x171 + α11x170 + α204x169 + α37x168 + α72x167 + α42x166 + α177x165 + α70x164 + α16x163 + α211x162 + α184x161 + α237x160 + α112x159 + α118x158 + α3x157 + α111x156 + α190x155 + α254x154 + α45x153 + α155x152 + α50x151 + α201x150 + α39x149 + α203x148 + α81x147 + α8x146 + α196x145 + α219x144 + α92x143 + α144x142 + α142x141 + α44x140 + α222x139 + α3x138 + α13x137 + α20x136 + α185x135 + α165x134 + α57x133 + α182x132 + α204x131 + α108x130 + α42x129 + α185x128 + α236x127 + α168x126 + α45x125 + α9x124 + α232x123 + α74x122 + α34x121 + α251x120 + α172x119 + α210x118 + α146x117 + α149x116 + α180x115 + α102x114 + α159x113 + α153x112 + α4x111 + α156x110 + α240x109 + α141x108 + α142x107 + α253x106 + α172x105 + α193x104 + α41x103 + α226x102 + α3x101 + α98x100 + α48x99 + α98x98 + α220x97 + α19x96 + α119x95 + α76x94 + α225x93 + α254x92 + α174x91 + α122x90 + α137x89 + α50x88 + α80x87 + α69x86 + α60x85 + α169x84 + α152x83 + α139x82 + α213x81 + α232x80 + α132x79 + α195x78 + α212x77 + α4x76 + α188x75 + α14x74 + α73x73 + α44x72 + α85x71 + α29x70 + α225x69 + α140x68 + α168x67 + α217x66 + α170x65 + α69x64 + α147x63 + α75x62 + α93x61 + α117x60 + α190x59 + α232x58 + α90x57 + α145x56 + α201x55 + α42x54 + α202x53 + α89x52 + α216x51 + α59x50 + α125x49 + α70x48 + α146x47 + α44x46 + α22x45 + α33x44 + α38x43 + α96x42 + α167x41 + α148x40 + α64x39 + α182x38 + α195x37 + α78x36 + α245x35 + α217x34 + α192x33 + α38x32 + α153x31 + α240x30 + α77x29 + α144x28 + α137x27 + α137x26 + α98x25 + α158x24 + α47x23 + α178x22 + α27x21 + α19x20 + α99x19 + α160x18 + α237x17 + α234x16 + α68x15 + α10x14 + α47x13 + α13x12 + α57x11 + α194x10 + α131x9 + α119x8 + α0x7 + α158x6 + α201x5 + α197x4 + α58x3 + α23x2 + α130x + α156"
    )
}

#[test]
fn generator_polynomial_90() {
    let poly = crate::generator_polynomial::generator(90);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x90 + α37x89 + α191x88 + α145x87 + α215x86 + α68x85 + α52x84 + α241x83 + α105x82 + α52x81 + α200x80 + α133x79 + α191x78 + α61x77 + α78x76 + α172x75 + α241x74 + α37x73 + α50x72 + α171x71 + α2x70 + α76x69 + α247x68 + α90x67 + α75x66 + α128x65 + α117x64 + α109x63 + α253x62 + α190x61 + α84x60 + α201x59 + α24x58 + α148x57 + α128x56 + α6x55 + α134x54 + α199x53 + α199x52 + α17x51 + α210x50 + α95x49 + α58x48 + α232x47 + α161x46 + α56x45 + α250x44 + α155x43 + α70x42 + α196x41 + α145x40 + α41x39 + α57x38 + α146x37 + α170x36 + α131x35 + α87x34 + α196x33 + α161x32 + α172x31 + α144x30 + α84x29 + α236x28 + α181x27 + α23x26 + α123x25 + α159x24 + α8x23 + α254x22 + α172x21 + α187x20 + α190x19 + α158x18 + α234x17 + α17x16 + α37x15 + α32x14 + α104x13 + α68x12 + α99x11 + α0x10 + α196x9 + α83x8 + α53x7 + α208x6 + α58x5 + α39x4 + α58x3 + α193x2 + α128x + α180"
    )
}

#[test]
fn generator_polynomial_168() {
    let poly = crate::generator_polynomial::generator(168);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x168 + α55x167 + α93x166 + α241x165 + α116x164 + α100x163 + α96x162 + α55x161 + α225x160 + α194x159 + α82x158 + α195x157 + α120x156 + α202x155 + α150x154 + α77x153 + α66x152 + α240x151 + α195x150 + α9x149 + α174x148 + α135x147 + α229x146 + α17x145 + α57x144 + α215x143 + α192x142 + α77x141 + α218x140 + α193x139 + α254x138 + α244x137 + α31x136 + α82x135 + α123x134 + α47x133 + α107x132 + α24x131 + α188x130 + α189x129 + α128x128 + α151x127 + α184x126 + α215x125 + α237x124 + α175x123 + α11x122 + α73x121 + α165x120 + α25x119 + α225x118 + α201x117 + α233x116 + α97x115 + α185x114 + α87x113 + α87x112 + α67x111 + α8x110 + α110x109 + α108x108 + α143x107 + α172x106 + α218x105 + α204x104 + α133x103 + α242x102 + α58x101 + α155x100 + α97x99 + α115x98 + α215x97 + α26x96 + α113x95 + α4x94 + α81x93 + α201x92 + α68x91 + α142x90 + α108x89 + α222x88 + α62x87 + α251x86 + α8x85 + α221x84 + α175x83 + α75x82 + α53x81 + α125x80 + α178x79 + α124x78 + α217x77 + α7x76 + α54x75 + α144x74 + α165x73 + α245x72 + α91x71 + α158x70 + α52x69 + α22x68 + α92x67 + α188x66 + α246x65 + α229x64 + α155x63 + α21x62 + α159x61 + α36x60 + α205x59 + α15x58 + α241x57 + α173x56 + α85x55 + α95x54 + α174x53 + α222x52 + α102x51 + α38x50 + α5x49 + α57x48 + α132x47 + α237x46 + α58x45 + α32x44 + α177x43 + α58x42 + α192x41 + α81x40 + α54x39 + α220x38 + α223x37 + α218x36 + α70x35 + α58x34 + α184x33 + α45x32 + α170x31 + α92x30 + α198x29 + α135x28 + α161x27 + α188x26 + α123x25 + α132x24 + α4x23 + α128x22 + α201x21 + α152x20 + α154x19 + α252x18 + α209x17 + α202x16 + α125x15 + α110x14 + α74x13 + α159x12 + α146x11 + α200x10 + α224x9 + α167x8 + α164x7 + α117x6 + α33x5 + α216x4 + α253x3 + α17x2 + α146x + α3"
    )
}

#[test]
fn generator_polynomial_254() {
    let poly = crate::generator_polynomial::generator(254);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x254 + α254x253 + α253x252 + α252x251 + α251x250 + α250x249 + α249x248 + α248x247 + α247x246 + α246x245 + α245x244 + α244x243 + α243x242 + α242x241 + α241x240 + α240x239 + α239x238 + α238x237 + α237x236 + α236x235 + α235x234 + α234x233 + α233x232 + α232x231 + α231x230 + α230x229 + α229x228 + α228x227 + α227x226 + α226x225 + α225x224 + α224x223 + α223x222 + α222x221 + α221x220 + α220x219 + α219x218 + α218x217 + α217x216 + α216x215 + α215x214 + α214x213 + α213x212 + α212x211 + α211x210 + α210x209 + α209x208 + α208x207 + α207x206 + α206x205 + α205x204 + α204x203 + α203x202 + α202x201 + α201x200 + α200x199 + α199x198 + α198x197 + α197x196 + α196x195 + α195x194 + α194x193 + α193x192 + α192x191 + α191x190 + α190x189 + α189x188 + α188x187 + α187x186 + α186x185 + α185x184 + α184x183 + α183x182 + α182x181 + α181x180 + α180x179 + α179x178 + α178x177 + α177x176 + α176x175 + α175x174 + α174x173 + α173x172 + α172x171 + α171x170 + α170x169 + α169x168 + α168x167 + α167x166 + α166x165 + α165x164 + α164x163 + α163x162 + α162x161 + α161x160 + α160x159 + α159x158 + α158x157 + α157x156 + α156x155 + α155x154 + α154x153 + α153x152 + α152x151 + α151x150 + α150x149 + α149x148 + α148x147 + α147x146 + α146x145 + α145x144 + α144x143 + α143x142 + α142x141 + α141x140 + α140x139 + α139x138 + α138x137 + α137x136 + α136x135 + α135x134 + α134x133 + α133x132 + α132x131 + α131x130 + α130x129 + α129x128 + α128x127 + α127x126 + α126x125 + α125x124 + α124x123 + α123x122 + α122x121 + α121x120 + α120x119 + α119x118 + α118x117 + α117x116 + α116x115 + α115x114 + α114x113 + α113x112 + α112x111 + α111x110 + α110x109 + α109x108 + α108x107 + α107x106 + α106x105 + α105x104 + α104x103 + α103x102 + α102x101 + α101x100 + α100x99 + α99x98 + α98x97 + α97x96 + α96x95 + α95x94 + α94x93 + α93x92 + α92x91 + α91x90 + α90x89 + α89x88 + α88x87 + α87x86 + α86x85 + α85x84 + α84x83 + α83x82 + α82x81 + α81x80 + α80x79 + α79x78 + α78x77 + α77x76 + α76x75 + α75x74 + α74x73 + α73x72 + α72x71 + α71x70 + α70x69 + α69x68 + α68x67 + α67x66 + α66x65 + α65x64 + α64x63 + α63x62 + α62x61 + α61x60 + α60x59 + α59x58 + α58x57 + α57x56 + α56x55 + α55x54 + α54x53 + α53x52 + α52x51 + α51x50 + α50x49 + α49x48 + α48x47 + α47x46 + α46x45 + α45x44 + α44x43 + α43x42 + α42x41 + α41x40 + α40x39 + α39x38 + α38x37 + α37x36 + α36x35 + α35x34 + α34x33 + α33x32 + α32x31 + α31x30 + α30x29 + α29x28 + α28x27 + α27x26 + α26x25 + α25x24 + α24x23 + α23x22 + α22x21 + α21x20 + α20x19 + α19x18 + α18x17 + α17x16 + α16x15 + α15x14 + α14x13 + α13x12 + α12x11 + α11x10 + α10x9 + α9x8 + α8x7 + α7x6 + α6x5 + α5x4 + α4x3 + α3x2 + α2x + α1"
    )
}

#[test]
fn generator_polynomial_180() {
    let poly = crate::generator_polynomial::generator(180);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x180 + α99x179 + α87x178 + α17x177 + α54x176 + α15x175 + α172x174 + α145x173 + α184x172 + α46x171 + α245x170 + α95x169 + α135x168 + α128x167 + α4x166 + α99x165 + α196x164 + α7x163 + α221x162 + α212x161 + α42x160 + α133x159 + α74x158 + α248x157 + α58x156 + α250x155 + α236x154 + α104x153 + α57x152 + α130x151 + α16x150 + α144x149 + α73x148 + α41x147 + α246x146 + α210x145 + α36x144 + α28x143 + α31x142 + α181x141 + α188x140 + α199x139 + α63x138 + α244x137 + α118x136 + α165x135 + α217x134 + α84x133 + α128x132 + α39x131 + α142x130 + α23x129 + α172x128 + α217x127 + α74x126 + α175x125 + α38x124 + α191x123 + α69x122 + α162x121 + α132x120 + α15x119 + α139x118 + α55x117 + α170x116 + α31x115 + α54x114 + α70x113 + α196x112 + α141x111 + α137x110 + α224x109 + α171x108 + α168x107 + α196x106 + α110x105 + α65x104 + α195x103 + α134x102 + α4x101 + α217x100 + α141x99 + α176x98 + α85x97 + α63x96 + α228x95 + α247x94 + α113x93 + α183x92 + α87x91 + α68x90 + α11x89 + α31x88 + α140x87 + α198x86 + α103x85 + α117x84 + α63x83 + α78x82 + α222x81 + α222x80 + α188x79 + α242x78 + α227x77 + α21x76 + α245x75 + α0x74 + α151x73 + α78x72 + α55x71 + α147x70 + α75x69 + α54x68 + α107x67 + α15x66 + α171x65 + α234x64 + α43x63 + α51x62 + α106x61 + α147x60 + α101x59 + α187x58 + α233x57 + α4x56 + α65x55 + α143x54 + α210x53 + α89x52 + α119x51 + α162x50 + α238x49 + α251x48 + α131x47 + α188x46 + α60x45 + α192x44 + α242x43 + α240x42 + α45x41 + α213x40 + α130x39 + α159x38 + α80x37 + α12x36 + α110x35 + α70x34 + α44x33 + α0x32 + α250x31 + α46x30 + α84x29 + α190x28 + α161x27 + α217x26 + α155x25 + α142x24 + α1x23 + α6x22 + α244x21 + α77x20 + α171x19 + α104x18 + α69x17 + α182x16 + α9x15 + α93x14 + α141x13 + α72x12 + α211x11 + α30x10 + α10x9 + α72x8 + α212x7 + α163x6 + α185x5 + α148x4 + α35x3 + α29x2 + α220x + α45"
    )
}

#[test]
fn generator_polynomial_162() {
    let poly = crate::generator_polynomial::generator(162);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x162 + α40x161 + α99x160 + α214x159 + α17x158 + α231x157 + α86x156 + α149x155 + α115x154 + α204x153 + α56x152 + α47x151 + α109x150 + α165x149 + α142x148 + α74x147 + α252x146 + α162x145 + α210x144 + α16x143 + α143x142 + α116x141 + α209x140 + α163x139 + α30x138 + α58x137 + α186x136 + α142x135 + α120x134 + α144x133 + α102x132 + α147x131 + α199x130 + α30x129 + α166x128 + α53x127 + α130x126 + α97x125 + α144x124 + α1x123 + α139x122 + α139x121 + α203x120 + α133x119 + α114x118 + α36x117 + α66x116 + α225x115 + α7x114 + α24x113 + α147x112 + α221x111 + α122x110 + α153x109 + α69x108 + α221x107 + α203x106 + α215x105 + α158x104 + α161x103 + α162x102 + α2x101 + α20x100 + α31x99 + α37x98 + α78x97 + α48x96 + α149x95 + α120x94 + α5x93 + α168x92 + α148x91 + α233x90 + α131x89 + α49x88 + α99x87 + α228x86 + α63x85 + α98x84 + α42x83 + α10x82 + α244x81 + α171x80 + α109x79 + α71x78 + α197x77 + α13x76 + α45x75 + α156x74 + α144x73 + α152x72 + α228x71 + α154x70 + α152x69 + α173x68 + α108x67 + α168x66 + α104x65 + α224x64 + α124x63 + α19x62 + α162x61 + α228x60 + α133x59 + α36x58 + α254x57 + α148x56 + α72x55 + α81x54 + α71x53 + α201x52 + α206x51 + α38x50 + α76x49 + α220x48 + α89x47 + α91x46 + α222x45 + α206x44 + α131x43 + α107x42 + α204x41 + α110x40 + α133x39 + α182x38 + α41x37 + α235x36 + α64x35 + α83x34 + α108x33 + α183x32 + α37x31 + α153x30 + α101x29 + α238x28 + α166x27 + α116x26 + α149x25 + α27x24 + α66x23 + α18x22 + α86x21 + α19x20 + α53x19 + α153x18 + α11x17 + α7x16 + α245x15 + α219x14 + α148x13 + α253x12 + α97x11 + α12x10 + α66x9 + α138x8 + α78x7 + α176x6 + α227x5 + α174x4 + α22x3 + α68x2 + α170x + α36"
    )
}

#[test]
fn generator_polynomial_138() {
    let poly = crate::generator_polynomial::generator(138);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x138 + α235x137 + α232x136 + α45x135 + α92x134 + α135x133 + α199x132 + α153x131 + α16x130 + α228x129 + α200x128 + α105x127 + α1x126 + α24x125 + α7x124 + α168x123 + α221x122 + α31x121 + α106x120 + α41x119 + α171x118 + α90x117 + α253x116 + α38x115 + α50x114 + α239x113 + α142x112 + α71x111 + α151x110 + α124x109 + α158x108 + α49x107 + α103x106 + α159x105 + α49x104 + α78x103 + α217x102 + α40x101 + α195x100 + α131x99 + α99x98 + α121x97 + α77x96 + α249x95 + α253x94 + α213x93 + α24x92 + α243x91 + α246x90 + α159x89 + α154x88 + α141x87 + α218x86 + α110x85 + α125x84 + α156x83 + α137x82 + α169x81 + α24x80 + α168x79 + α14x78 + α100x77 + α44x76 + α164x75 + α101x74 + α106x73 + α122x72 + α167x71 + α71x70 + α73x69 + α208x68 + α186x67 + α23x66 + α144x65 + α21x64 + α221x63 + α238x62 + α176x61 + α227x60 + α8x59 + α1x58 + α28x57 + α133x56 + α34x55 + α140x54 + α7x53 + α252x52 + α57x51 + α207x50 + α94x49 + α63x48 + α197x47 + α115x46 + α186x45 + α108x44 + α241x43 + α206x42 + α132x41 + α247x40 + α161x39 + α107x38 + α89x37 + α148x36 + α146x35 + α254x34 + α246x33 + α72x32 + α155x31 + α146x30 + α249x29 + α158x28 + α215x27 + α168x26 + α147x25 + α95x24 + α220x23 + α62x22 + α36x21 + α254x20 + α6x19 + α208x18 + α15x17 + α87x16 + α171x15 + α147x14 + α46x13 + α160x12 + α146x11 + α123x10 + α33x9 + α213x8 + α232x7 + α160x6 + α233x5 + α72x4 + α162x3 + α231x2 + α116x + α18"
    )
}

#[test]
fn generator_polynomial_31() {
    let poly = crate::generator_polynomial::generator(31);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x31 + α20x30 + α37x29 + α252x28 + α93x27 + α63x26 + α75x25 + α225x24 + α31x23 + α115x22 + α83x21 + α113x20 + α39x19 + α44x18 + α73x17 + α122x16 + α137x15 + α118x14 + α119x13 + α144x12 + α248x11 + α248x10 + α55x9 + α1x8 + α225x7 + α105x6 + α123x5 + α183x4 + α117x3 + α187x2 + α200x + α210"
    )
}

#[test]
fn generator_polynomial_82() {
    let poly = crate::generator_polynomial::generator(82);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x82 + α34x81 + α145x80 + α92x79 + α169x78 + α247x77 + α34x76 + α41x75 + α47x74 + α38x73 + α7x72 + α222x71 + α215x70 + α192x69 + α111x68 + α109x67 + α195x66 + α173x65 + α112x64 + α108x63 + α140x62 + α240x61 + α212x60 + α170x59 + α21x58 + α151x57 + α61x56 + α114x55 + α11x54 + α66x53 + α176x52 + α47x51 + α26x50 + α45x49 + α139x48 + α139x47 + α50x46 + α44x45 + α183x44 + α75x43 + α151x42 + α54x41 + α232x40 + α237x39 + α171x38 + α113x37 + α200x36 + α115x35 + α196x34 + α183x33 + α245x32 + α92x31 + α47x30 + α18x29 + α44x28 + α228x27 + α1x26 + α172x25 + α123x24 + α98x23 + α221x22 + α75x21 + α56x20 + α105x19 + α190x18 + α77x17 + α180x16 + α175x15 + α3x14 + α165x13 + α14x12 + α102x11 + α223x10 + α80x9 + α170x8 + α245x7 + α64x6 + α103x5 + α106x4 + α110x3 + α244x2 + α214x + α6"
    )
}

#[test]
fn generator_polynomial_23() {
    let poly = crate::generator_polynomial::generator(23);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x23 + α171x22 + α102x21 + α146x20 + α91x19 + α49x18 + α103x17 + α65x16 + α17x15 + α193x14 + α150x13 + α14x12 + α25x11 + α183x10 + α248x9 + α94x8 + α164x7 + α224x6 + α192x5 + α1x4 + α78x3 + α56x2 + α147x + α253"
    )
}

#[test]
fn generator_polynomial_34() {
    let poly = crate::generator_polynomial::generator(34);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x34 + α111x33 + α77x32 + α146x31 + α94x30 + α26x29 + α21x28 + α108x27 + α19x26 + α105x25 + α94x24 + α113x23 + α193x22 + α86x21 + α140x20 + α163x19 + α125x18 + α58x17 + α158x16 + α229x15 + α239x14 + α218x13 + α103x12 + α56x11 + α70x10 + α114x9 + α61x8 + α183x7 + α129x6 + α167x5 + α13x4 + α98x3 + α62x2 + α129x + α51"
    )
}

#[test]
fn generator_polynomial_169() {
    let poly = crate::generator_polynomial::generator(169);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x169 + α131x168 + α162x167 + α28x166 + α45x165 + α138x164 + α70x163 + α146x162 + α18x161 + α14x160 + α83x159 + α3x158 + α235x157 + α189x156 + α147x155 + α32x154 + α103x153 + α170x152 + α173x151 + α22x150 + α142x149 + α85x148 + α77x147 + α211x146 + α197x145 + α236x144 + α198x143 + α15x142 + α67x141 + α221x140 + α57x139 + α140x138 + α141x137 + α204x136 + α135x135 + α26x134 + α13x133 + α120x132 + α33x131 + α21x130 + α45x129 + α167x128 + α73x127 + α6x126 + α199x125 + α151x124 + α239x123 + α112x122 + α23x121 + α172x120 + α228x119 + α193x118 + α12x117 + α39x116 + α98x115 + α77x114 + α167x113 + α216x112 + α173x111 + α140x110 + α193x109 + α138x108 + α15x107 + α80x106 + α112x105 + α7x104 + α69x103 + α248x102 + α9x101 + α249x100 + α3x99 + α232x98 + α247x97 + α18x96 + α239x95 + α35x94 + α199x93 + α205x92 + α89x91 + α202x90 + α175x89 + α43x88 + α240x87 + α177x86 + α207x85 + α36x84 + α174x83 + α150x82 + α121x81 + α166x80 + α106x79 + α161x78 + α190x77 + α97x76 + α101x75 + α218x74 + α165x73 + α52x72 + α205x71 + α144x70 + α48x69 + α231x68 + α128x67 + α117x66 + α223x65 + α241x64 + α122x63 + α225x62 + α6x61 + α229x60 + α89x59 + α35x58 + α246x57 + α110x56 + α188x55 + α122x54 + α231x53 + α117x52 + α211x51 + α159x50 + α16x49 + α35x48 + α37x47 + α77x46 + α157x45 + α118x44 + α93x43 + α73x42 + α80x41 + α126x40 + α15x39 + α195x38 + α195x37 + α1x36 + α182x35 + α204x34 + α186x33 + α36x32 + α203x31 + α33x30 + α110x29 + α124x28 + α240x27 + α81x26 + α32x25 + α161x24 + α88x23 + α122x22 + α43x21 + α13x20 + α61x19 + α125x18 + α35x17 + α136x16 + α233x15 + α6x14 + α216x13 + α175x12 + α111x11 + α104x10 + α203x9 + α120x8 + α161x7 + α253x6 + α234x5 + α54x4 + α205x3 + α252x2 + α134x + α171"
    )
}

#[test]
fn generator_polynomial_20() {
    let poly = crate::generator_polynomial::generator(20);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x20 + α17x19 + α60x18 + α79x17 + α50x16 + α61x15 + α163x14 + α26x13 + α187x12 + α202x11 + α180x10 + α221x9 + α225x8 + α83x7 + α239x6 + α156x5 + α164x4 + α212x3 + α212x2 + α188x + α190"
    )
}

#[test]
fn generator_polynomial_51() {
    let poly = crate::generator_polynomial::generator(51);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x51 + α213x50 + α166x49 + α142x48 + α43x47 + α10x46 + α216x45 + α141x44 + α163x43 + α172x42 + α180x41 + α102x40 + α70x39 + α89x38 + α62x37 + α222x36 + α62x35 + α42x34 + α210x33 + α151x32 + α163x31 + α218x30 + α70x29 + α77x28 + α39x27 + α166x26 + α191x25 + α114x24 + α202x23 + α245x22 + α188x21 + α183x20 + α221x19 + α75x18 + α212x17 + α27x16 + α237x15 + α127x14 + α204x13 + α235x12 + α62x11 + α190x10 + α232x9 + α18x8 + α46x7 + α171x6 + α15x5 + α98x4 + α247x3 + α66x2 + α163x + α0"
    )
}

#[test]
fn generator_polynomial_119() {
    let poly = crate::generator_polynomial::generator(119);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x119 + α128x118 + α243x117 + α144x116 + α6x115 + α115x114 + α95x113 + α65x112 + α134x111 + α13x110 + α127x109 + α218x108 + α8x107 + α234x106 + α62x105 + α36x104 + α188x103 + α210x102 + α208x101 + α181x100 + α162x99 + α185x98 + α110x97 + α126x96 + α146x95 + α90x94 + α119x93 + α199x92 + α52x91 + α108x90 + α133x89 + α66x88 + α237x87 + α166x86 + α50x85 + α222x84 + α72x83 + α241x82 + α153x81 + α245x80 + α113x79 + α170x78 + α148x77 + α42x76 + α238x75 + α195x74 + α206x73 + α132x72 + α121x71 + α81x70 + α192x69 + α134x68 + α61x67 + α182x66 + α57x65 + α210x64 + α204x63 + α232x62 + α17x61 + α179x60 + α238x59 + α194x58 + α17x57 + α107x56 + α231x55 + α196x54 + α184x53 + α181x52 + α117x51 + α38x50 + α45x49 + α203x48 + α77x47 + α14x46 + α121x45 + α27x44 + α204x43 + α173x42 + α58x41 + α119x40 + α114x39 + α140x38 + α91x37 + α40x36 + α53x35 + α254x34 + α233x33 + α167x32 + α114x31 + α44x30 + α137x29 + α199x28 + α209x27 + α247x26 + α81x25 + α0x24 + α98x23 + α200x22 + α138x21 + α233x20 + α115x19 + α5x18 + α125x17 + α221x16 + α187x15 + α76x14 + α111x13 + α3x12 + α76x11 + α103x10 + α107x9 + α91x8 + α140x7 + α33x6 + α171x5 + α180x4 + α181x3 + α143x2 + α146x + α136"
    )
}

#[test]
fn generator_polynomial_247() {
    let poly = crate::generator_polynomial::generator(247);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x247 + α167x246 + α229x245 + α19x244 + α156x243 + α137x242 + α37x241 + α141x240 + α221x239 + α238x238 + α22x237 + α9x236 + α221x235 + α156x234 + α189x233 + α128x232 + α171x231 + α94x230 + α102x229 + α200x228 + α254x227 + α174x226 + α112x225 + α229x224 + α12x223 + α38x222 + α102x221 + α126x220 + α212x219 + α248x218 + α98x217 + α229x216 + α37x215 + α98x214 + α111x213 + α91x212 + α234x211 + α7x210 + α101x209 + α124x208 + α133x207 + α221x206 + α135x205 + α8x204 + α23x203 + α125x202 + α127x201 + α226x200 + α28x199 + α209x198 + α27x197 + α143x196 + α76x195 + α53x194 + α23x193 + α42x192 + α213x191 + α192x190 + α239x189 + α179x188 + α0x187 + α78x186 + α110x185 + α111x184 + α142x183 + α167x182 + α110x181 + α244x180 + α163x179 + α138x178 + α39x177 + α134x176 + α105x175 + α29x174 + α78x173 + α185x172 + α121x171 + α180x170 + α130x169 + α190x168 + α181x167 + α188x166 + α69x165 + α66x164 + α227x163 + α68x162 + α231x161 + α3x160 + α251x159 + α36x158 + α156x157 + α78x156 + α64x155 + α157x154 + α249x153 + α31x152 + α101x151 + α185x150 + α31x149 + α49x148 + α95x147 + α201x146 + α43x145 + α87x144 + α43x143 + α49x142 + α78x141 + α178x140 + α252x139 + α132x138 + α120x137 + α30x136 + α168x135 + α93x134 + α217x133 + α83x132 + α44x131 + α94x130 + α116x129 + α65x128 + α60x127 + α149x126 + α8x125 + α141x124 + α9x123 + α122x122 + α254x121 + α156x120 + α152x119 + α194x118 + α163x117 + α104x116 + α134x115 + α4x114 + α126x113 + α192x112 + α45x111 + α126x110 + α129x109 + α240x108 + α157x107 + α48x106 + α10x105 + α250x104 + α30x103 + α232x102 + α126x101 + α11x100 + α211x99 + α184x98 + α74x97 + α236x96 + α157x95 + α111x94 + α10x93 + α163x92 + α168x91 + α237x90 + α108x89 + α59x88 + α57x87 + α21x86 + α104x85 + α254x84 + α84x83 + α78x82 + α188x81 + α172x80 + α172x79 + α103x78 + α144x77 + α76x76 + α131x75 + α15x74 + α212x73 + α24x72 + α44x71 + α195x70 + α30x69 + α46x68 + α118x67 + α230x66 + α23x65 + α244x64 + α204x63 + α194x62 + α153x61 + α66x60 + α236x59 + α32x58 + α231x57 + α243x56 + α63x55 + α35x54 + α56x53 + α70x52 + α128x51 + α3x50 + α176x49 + α241x48 + α175x47 + α67x46 + α56x45 + α200x44 + α176x43 + α39x42 + α116x41 + α19x40 + α1x39 + α224x38 + α121x37 + α84x36 + α187x35 + α198x34 + α176x33 + α106x32 + α34x31 + α149x30 + α35x29 + α245x28 + α150x27 + α117x26 + α44x25 + α9x24 + α217x23 + α91x22 + α144x21 + α215x20 + α152x19 + α45x18 + α28x17 + α96x16 + α44x15 + α96x14 + α54x13 + α110x12 + α144x11 + α148x10 + α100x9 + α74x8 + α240x7 + α127x6 + α218x5 + α228x4 + α82x3 + α28x2 + α212x + α36"
    )
}

#[test]
fn generator_polynomial_139() {
    let poly = crate::generator_polynomial::generator(139);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x139 + α73x138 + α29x137 + α109x136 + α46x135 + α56x134 + α47x133 + α191x132 + α58x131 + α2x130 + α59x129 + α63x128 + α87x127 + α12x126 + α166x125 + α86x124 + α136x123 + α12x122 + α161x121 + α130x120 + α116x119 + α24x118 + α229x117 + α177x116 + α160x115 + α171x114 + α164x113 + α162x112 + α3x111 + α96x110 + α185x109 + α241x108 + α143x107 + α218x106 + α154x105 + α149x104 + α241x103 + α172x102 + α246x101 + α225x100 + α184x99 + α80x98 + α240x97 + α96x96 + α175x95 + α109x94 + α219x93 + α67x92 + α135x91 + α195x90 + α49x89 + α64x88 + α149x87 + α221x86 + α53x85 + α214x84 + α178x83 + α208x82 + α217x81 + α98x80 + α193x79 + α241x78 + α169x77 + α149x76 + α0x75 + α101x74 + α239x73 + α70x72 + α60x71 + α107x70 + α176x69 + α12x68 + α160x67 + α212x66 + α212x65 + α249x64 + α26x63 + α184x62 + α139x61 + α229x60 + α17x59 + α19x58 + α148x57 + α1x56 + α175x55 + α152x54 + α203x53 + α14x52 + α67x51 + α190x50 + α219x49 + α42x48 + α112x47 + α147x46 + α175x45 + α124x44 + α183x43 + α210x42 + α188x41 + α175x40 + α99x39 + α3x38 + α67x37 + α19x36 + α65x35 + α208x34 + α155x33 + α218x32 + α199x31 + α26x30 + α75x29 + α120x28 + α162x27 + α47x26 + α192x25 + α64x24 + α219x23 + α154x22 + α87x21 + α62x20 + α214x19 + α128x18 + α117x17 + α124x16 + α212x15 + α175x14 + α159x13 + α117x12 + α231x11 + α110x10 + α191x9 + α130x8 + α146x7 + α140x6 + α32x5 + α160x4 + α106x3 + α164x2 + α91x + α156"
    )
}

#[test]
fn generator_polynomial_183() {
    let poly = crate::generator_polynomial::generator(183);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x183 + α98x182 + α212x181 + α20x180 + α47x179 + α205x178 + α170x177 + α198x176 + α100x175 + α76x174 + α143x173 + α140x172 + α253x171 + α122x170 + α251x169 + α133x168 + α83x167 + α118x166 + α9x165 + α162x164 + α2x163 + α194x162 + α45x161 + α234x160 + α84x159 + α7x158 + α182x157 + α145x156 + α148x155 + α154x154 + α63x153 + α167x152 + α134x151 + α74x150 + α114x149 + α49x148 + α65x147 + α230x146 + α45x145 + α248x144 + α83x143 + α116x142 + α100x141 + α73x140 + α29x139 + α140x138 + α53x137 + α44x136 + α127x135 + α122x134 + α91x133 + α153x132 + α123x131 + α84x130 + α253x129 + α228x128 + α37x127 + α22x126 + α82x125 + α252x124 + α104x123 + α161x122 + α249x121 + α44x120 + α46x119 + α101x118 + α45x117 + α17x116 + α26x115 + α207x114 + α123x113 + α160x112 + α43x111 + α125x110 + α221x109 + α167x108 + α35x107 + α196x106 + α100x105 + α252x104 + α190x103 + α184x102 + α172x101 + α244x100 + α36x99 + α218x98 + α200x97 + α54x96 + α217x95 + α23x94 + α252x93 + α36x92 + α127x91 + α15x90 + α223x89 + α89x88 + α108x87 + α181x86 + α126x85 + α126x84 + α6x83 + α116x82 + α55x81 + α243x80 + α232x79 + α7x78 + α30x77 + α51x76 + α110x75 + α91x74 + α177x73 + α22x72 + α66x71 + α211x70 + α222x69 + α223x68 + α141x67 + α96x66 + α79x65 + α206x64 + α131x63 + α8x62 + α102x61 + α227x60 + α47x59 + α59x58 + α181x57 + α123x56 + α241x55 + α193x54 + α206x53 + α172x52 + α129x51 + α249x50 + α207x49 + α139x48 + α238x47 + α174x46 + α188x45 + α4x44 + α230x43 + α184x42 + α127x41 + α21x40 + α113x39 + α92x38 + α204x37 + α221x36 + α132x35 + α124x34 + α11x33 + α253x32 + α213x31 + α36x30 + α54x29 + α230x28 + α154x27 + α118x26 + α125x25 + α129x24 + α206x23 + α199x22 + α20x21 + α10x20 + α97x19 + α126x18 + α162x17 + α54x16 + α31x15 + α76x14 + α129x13 + α187x12 + α1x11 + α186x10 + α46x9 + α252x8 + α22x7 + α176x6 + α138x5 + α162x4 + α62x3 + α181x2 + α249x + α78"
    )
}

#[test]
fn generator_polynomial_187() {
    let poly = crate::generator_polynomial::generator(187);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x187 + α179x186 + α191x185 + α219x184 + α160x183 + α149x182 + α126x181 + α49x180 + α235x179 + α160x178 + α44x177 + α198x176 + α177x175 + α178x174 + α46x173 + α4x172 + α103x171 + α7x170 + α124x169 + α206x168 + α8x167 + α105x166 + α5x165 + α58x164 + α200x163 + α150x162 + α42x161 + α72x160 + α242x159 + α244x158 + α45x157 + α71x156 + α236x155 + α157x154 + α0x153 + α121x152 + α157x151 + α192x150 + α188x149 + α53x148 + α214x147 + α150x146 + α133x145 + α70x144 + α33x143 + α196x142 + α67x141 + α64x140 + α241x139 + α190x138 + α242x137 + α100x136 + α44x135 + α93x134 + α115x133 + α101x132 + α85x131 + α114x130 + α133x129 + α93x128 + α160x127 + α46x126 + α127x125 + α73x124 + α246x123 + α76x122 + α228x121 + α121x120 + α180x119 + α16x118 + α185x117 + α13x116 + α103x115 + α182x114 + α63x113 + α14x112 + α238x111 + α77x110 + α68x109 + α43x108 + α115x107 + α93x106 + α154x105 + α172x104 + α242x103 + α230x102 + α39x101 + α5x100 + α176x99 + α74x98 + α240x97 + α56x96 + α124x95 + α234x94 + α72x93 + α148x92 + α11x91 + α126x90 + α146x89 + α179x88 + α194x87 + α159x86 + α26x85 + α224x84 + α85x83 + α253x82 + α123x81 + α76x80 + α190x79 + α146x78 + α86x77 + α178x76 + α140x75 + α120x74 + α170x73 + α22x72 + α118x71 + α221x70 + α238x69 + α78x68 + α205x67 + α243x66 + α22x65 + α123x64 + α136x63 + α121x62 + α226x61 + α16x60 + α135x59 + α106x58 + α18x57 + α175x56 + α122x55 + α67x54 + α231x53 + α113x52 + α100x51 + α173x50 + α52x49 + α34x48 + α43x47 + α232x46 + α37x45 + α60x44 + α28x43 + α22x42 + α225x41 + α220x40 + α245x39 + α56x38 + α246x37 + α142x36 + α37x35 + α102x34 + α190x33 + α200x32 + α221x31 + α126x30 + α1x29 + α185x28 + α201x27 + α102x26 + α141x25 + α122x24 + α166x23 + α44x22 + α75x21 + α164x20 + α38x19 + α142x18 + α211x17 + α238x16 + α70x15 + α43x14 + α106x13 + α36x12 + α243x11 + α20x10 + α67x9 + α73x8 + α73x7 + α81x6 + α35x5 + α232x4 + α222x3 + α125x2 + α44x + α51"
    )
}

#[test]
fn generator_polynomial_237() {
    let poly = crate::generator_polynomial::generator(237);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x237 + α197x236 + α221x235 + α22x234 + α169x233 + α248x232 + α235x231 + α104x230 + α142x229 + α202x228 + α12x227 + α197x226 + α233x225 + α182x224 + α240x223 + α224x222 + α76x221 + α126x220 + α155x219 + α15x218 + α134x217 + α35x216 + α143x215 + α13x214 + α153x213 + α154x212 + α59x211 + α152x210 + α227x209 + α165x208 + α182x207 + α117x206 + α6x205 + α230x204 + α59x203 + α150x202 + α54x201 + α65x200 + α181x199 + α188x198 + α169x197 + α101x196 + α145x195 + α138x194 + α91x193 + α132x192 + α32x191 + α238x190 + α129x189 + α199x188 + α140x187 + α156x186 + α127x185 + α26x184 + α164x183 + α23x182 + α110x181 + α112x180 + α186x179 + α199x178 + α22x177 + α30x176 + α96x175 + α191x174 + α8x173 + α142x172 + α151x171 + α212x170 + α92x169 + α186x168 + α16x167 + α64x166 + α54x165 + α117x164 + α205x163 + α7x162 + α34x161 + α245x160 + α191x159 + α250x158 + α254x157 + α215x156 + α151x155 + α80x154 + α69x153 + α102x152 + α171x151 + α13x150 + α68x149 + α141x148 + α119x147 + α53x146 + α87x145 + α37x144 + α63x143 + α131x142 + α193x141 + α151x140 + α237x139 + α165x138 + α10x137 + α109x136 + α23x135 + α195x134 + α193x133 + α44x132 + α170x131 + α19x130 + α34x129 + α55x128 + α178x127 + α54x126 + α13x125 + α243x124 + α115x123 + α169x122 + α187x121 + α224x120 + α186x119 + α49x118 + α68x117 + α12x116 + α230x115 + α157x114 + α11x113 + α17x112 + α39x111 + α144x110 + α2x109 + α217x108 + α183x107 + α60x106 + α170x105 + α45x104 + α28x103 + α92x102 + α159x101 + α41x100 + α177x99 + α230x98 + α125x97 + α148x96 + α67x95 + α235x94 + α190x93 + α221x92 + α168x91 + α215x90 + α218x89 + α126x88 + α52x87 + α191x86 + α103x85 + α51x84 + α43x83 + α95x82 + α140x81 + α160x80 + α137x79 + α59x78 + α94x77 + α119x76 + α73x75 + α252x74 + α145x73 + α63x72 + α54x71 + α242x70 + α138x69 + α25x68 + α126x67 + α46x66 + α18x65 + α120x64 + α29x63 + α170x62 + α85x61 + α58x60 + α216x59 + α184x58 + α91x57 + α70x56 + α219x55 + α86x54 + α184x53 + α11x52 + α21x51 + α241x50 + α26x49 + α192x48 + α27x47 + α57x46 + α138x45 + α78x44 + α106x43 + α94x42 + α31x41 + α80x40 + α80x39 + α54x38 + α174x37 + α144x36 + α221x35 + α111x34 + α8x33 + α20x32 + α112x31 + α158x30 + α122x29 + α165x28 + α71x27 + α214x26 + α35x25 + α15x24 + α111x23 + α222x22 + α95x21 + α175x20 + α37x19 + α158x18 + α110x17 + α41x16 + α170x15 + α167x14 + α90x13 + α122x12 + α67x11 + α118x10 + α34x9 + α210x8 + α153x7 + α10x6 + α4x5 + α161x4 + α250x3 + α175x2 + α132x + α171"
    )
}

#[test]
fn generator_polynomial_200() {
    let poly = crate::generator_polynomial::generator(200);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x200 + α238x199 + α9x198 + α69x197 + α21x196 + α165x195 + α51x194 + α70x193 + α160x192 + α40x191 + α34x190 + α151x189 + α254x188 + α61x187 + α54x186 + α96x185 + α215x184 + α201x183 + α101x182 + α190x181 + α196x180 + α75x179 + α153x178 + α130x177 + α33x176 + α151x175 + α66x174 + α67x173 + α133x172 + α209x171 + α128x170 + α198x169 + α95x168 + α192x167 + α176x166 + α37x165 + α74x164 + α49x163 + α84x162 + α81x161 + α144x160 + α108x159 + α29x158 + α43x157 + α167x156 + α94x155 + α161x154 + α52x153 + α220x152 + α42x151 + α12x150 + α222x149 + α65x148 + α176x147 + α74x146 + α27x145 + α222x144 + α75x143 + α175x142 + α114x141 + α93x140 + α95x139 + α164x138 + α176x137 + α215x136 + α151x135 + α75x134 + α102x133 + α147x132 + α145x131 + α206x130 + α236x129 + α96x128 + α72x127 + α54x126 + α39x125 + α195x124 + α223x123 + α16x122 + α37x121 + α246x120 + α175x119 + α95x118 + α29x117 + α194x116 + α67x115 + α153x114 + α238x113 + α226x112 + α118x111 + α136x110 + α143x109 + α31x108 + α126x107 + α75x106 + α32x105 + α124x104 + α57x103 + α89x102 + α140x101 + α27x100 + α84x99 + α232x98 + α144x97 + α155x96 + α7x95 + α249x94 + α244x93 + α93x92 + α149x91 + α86x90 + α12x89 + α64x88 + α20x87 + α134x86 + α247x85 + α63x84 + α97x83 + α107x82 + α131x81 + α146x80 + α136x79 + α59x78 + α210x77 + α126x76 + α169x75 + α128x74 + α90x73 + α58x72 + α142x71 + α56x70 + α194x69 + α140x68 + α39x67 + α211x66 + α231x65 + α239x64 + α144x63 + α76x62 + α206x61 + α148x60 + α113x59 + α118x58 + α217x57 + α53x56 + α57x55 + α48x54 + α94x53 + α182x52 + α28x51 + α17x50 + α246x49 + α113x48 + α144x47 + α197x46 + α74x45 + α91x44 + α166x43 + α96x42 + α119x41 + α99x40 + α235x39 + α182x38 + α91x37 + α60x36 + α222x35 + α50x34 + α10x33 + α112x32 + α159x31 + α33x30 + α58x29 + α181x28 + α59x27 + α2x26 + α31x25 + α112x24 + α153x23 + α120x22 + α241x21 + α51x20 + α244x19 + α99x18 + α143x17 + α101x16 + α181x15 + α83x14 + α34x13 + α171x12 + α12x11 + α94x10 + α44x9 + α108x8 + α217x7 + α142x6 + α200x5 + α0x4 + α247x3 + α131x2 + α49x + α10"
    )
}

#[test]
fn generator_polynomial_105() {
    let poly = crate::generator_polynomial::generator(105);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x105 + α223x104 + α201x103 + α54x102 + α178x101 + α91x100 + α164x99 + α71x98 + α17x97 + α95x96 + α79x95 + α20x94 + α106x93 + α177x92 + α240x91 + α175x90 + α107x89 + α3x88 + α210x87 + α48x86 + α12x85 + α192x84 + α18x83 + α156x82 + α239x81 + α167x80 + α162x79 + α3x78 + α49x77 + α124x76 + α200x75 + α129x74 + α228x73 + α226x72 + α63x71 + α174x70 + α48x69 + α35x68 + α160x67 + α53x66 + α38x65 + α83x64 + α174x63 + α150x62 + α68x61 + α12x60 + α52x59 + α79x58 + α235x57 + α169x56 + α92x55 + α222x54 + α85x53 + α137x52 + α123x51 + α97x50 + α23x49 + α193x48 + α141x47 + α218x46 + α27x45 + α187x44 + α118x43 + α246x42 + α4x41 + α63x40 + α182x39 + α138x38 + α117x37 + α234x36 + α209x35 + α202x34 + α214x33 + α65x32 + α70x31 + α245x30 + α18x29 + α47x28 + α105x27 + α113x26 + α222x25 + α143x24 + α164x23 + α130x22 + α153x21 + α77x20 + α217x19 + α228x18 + α125x17 + α78x16 + α250x15 + α164x14 + α205x13 + α238x12 + α1x11 + α164x10 + α29x9 + α55x8 + α213x7 + α155x6 + α186x5 + α122x4 + α102x3 + α98x2 + α224x + α105"
    )
}

#[test]
fn generator_polynomial_55() {
    let poly = crate::generator_polynomial::generator(55);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x55 + α38x54 + α197x53 + α123x52 + α167x51 + α16x50 + α87x49 + α178x48 + α238x47 + α227x46 + α97x45 + α148x44 + α247x43 + α26x42 + α90x41 + α228x40 + α182x39 + α236x38 + α197x37 + α47x36 + α249x35 + α36x34 + α213x33 + α54x32 + α113x31 + α181x30 + α74x29 + α177x28 + α204x27 + α155x26 + α61x25 + α47x24 + α42x23 + α0x22 + α132x21 + α144x20 + α251x19 + α200x18 + α38x17 + α38x16 + α138x15 + α54x14 + α44x13 + α64x12 + α19x11 + α22x10 + α206x9 + α16x8 + α10x7 + α228x6 + α211x5 + α161x4 + α171x3 + α44x2 + α194x + α210"
    )
}

#[test]
fn generator_polynomial_228() {
    let poly = crate::generator_polynomial::generator(228);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x228 + α52x227 + α168x226 + α99x225 + α38x224 + α173x223 + α245x222 + α121x221 + α30x220 + α170x219 + α92x218 + α254x217 + α29x216 + α9x215 + α97x214 + α194x213 + α42x212 + α68x211 + α16x210 + α183x209 + α251x208 + α60x207 + α51x206 + α25x205 + α1x204 + α211x203 + α127x202 + α143x201 + α131x200 + α241x199 + α24x198 + α35x197 + α80x196 + α120x195 + α89x194 + α216x193 + α54x192 + α158x191 + α17x190 + α46x189 + α220x188 + α252x187 + α222x186 + α204x185 + α26x184 + α77x183 + α108x182 + α216x181 + α39x180 + α14x179 + α98x178 + α61x177 + α105x176 + α105x175 + α38x174 + α108x173 + α9x172 + α211x171 + α117x170 + α178x169 + α6x168 + α215x167 + α18x166 + α139x165 + α104x164 + α124x163 + α86x162 + α1x161 + α159x160 + α178x159 + α83x158 + α137x157 + α54x156 + α59x155 + α188x154 + α9x153 + α90x152 + α164x151 + α207x150 + α254x149 + α98x148 + α224x147 + α44x146 + α31x145 + α90x144 + α139x143 + α132x142 + α14x141 + α233x140 + α246x139 + α116x138 + α2x137 + α120x136 + α88x135 + α123x134 + α218x133 + α57x132 + α23x131 + α37x130 + α191x129 + α15x128 + α208x127 + α100x126 + α238x125 + α253x124 + α34x123 + α28x122 + α193x121 + α182x120 + α228x119 + α109x118 + α137x117 + α108x116 + α103x115 + α38x114 + α75x113 + α52x112 + α53x111 + α252x110 + α88x109 + α14x108 + α252x107 + α59x106 + α37x105 + α228x104 + α185x103 + α19x102 + α99x101 + α133x100 + α26x99 + α99x98 + α57x97 + α63x96 + α196x95 + α73x94 + α10x93 + α14x92 + α123x91 + α209x90 + α56x89 + α15x88 + α23x87 + α113x86 + α92x85 + α15x84 + α183x83 + α168x82 + α65x81 + α166x80 + α39x79 + α219x78 + α148x77 + α46x76 + α192x75 + α88x74 + α186x73 + α153x72 + α208x71 + α126x70 + α193x69 + α146x68 + α215x67 + α17x66 + α27x65 + α234x64 + α241x63 + α92x62 + α6x61 + α24x60 + α168x59 + α79x58 + α145x57 + α170x56 + α241x55 + α143x54 + α182x53 + α154x52 + α82x51 + α91x50 + α234x49 + α231x48 + α125x47 + α244x46 + α185x45 + α106x44 + α1x43 + α246x42 + α248x41 + α188x40 + α241x39 + α184x38 + α42x37 + α165x36 + α44x35 + α144x34 + α147x33 + α79x32 + α6x31 + α222x30 + α156x29 + α18x28 + α2x27 + α213x26 + α14x25 + α31x24 + α27x23 + α25x22 + α6x21 + α169x20 + α73x19 + α133x18 + α157x17 + α103x16 + α227x15 + α102x14 + α241x13 + α233x12 + α175x11 + α240x10 + α35x9 + α122x8 + α185x7 + α26x6 + α181x5 + α18x4 + α51x3 + α92x2 + α203x + α123"
    )
}

#[test]
fn generator_polynomial_126() {
    let poly = crate::generator_polynomial::generator(126);
    let poly_string = crate::generator_polynomial::generated_to_string(&poly);
    assert_eq!(
        poly_string,
        "α0x126 + α85x125 + α230x124 + α189x123 + α20x122 + α3x121 + α115x120 + α18x119 + α233x118 + α30x117 + α140x116 + α119x115 + α246x114 + α70x113 + α190x112 + α178x111 + α39x110 + α113x109 + α216x108 + α48x107 + α83x106 + α132x105 + α166x104 + α19x103 + α117x102 + α106x101 + α235x100 + α161x99 + α8x98 + α249x97 + α147x96 + α128x95 + α45x94 + α9x93 + α64x92 + α85x91 + α104x90 + α23x89 + α79x88 + α186x87 + α53x86 + α178x85 + α114x84 + α75x83 + α215x82 + α32x81 + α100x80 + α213x79 + α181x78 + α244x77 + α9x76 + α189x75 + α43x74 + α51x73 + α132x72 + α63x71 + α96x70 + α133x69 + α213x68 + α206x67 + α94x66 + α253x65 + α131x64 + α208x63 + α1x62 + α248x61 + α214x60 + α196x59 + α73x58 + α118x57 + α206x56 + α43x55 + α237x54 + α26x53 + α143x52 + α159x51 + α104x50 + α209x49 + α16x48 + α173x47 + α185x46 + α242x45 + α40x44 + α25x43 + α189x42 + α123x41 + α123x40 + α126x39 + α144x38 + α213x37 + α164x36 + α15x35 + α119x34 + α189x33 + α95x32 + α48x31 + α192x30 + α164x29 + α48x28 + α71x27 + α15x26 + α11x25 + α147x24 + α174x23 + α191x22 + α27x21 + α103x20 + α193x19 + α231x18 + α253x17 + α49x16 + α58x15 + α195x14 + α200x13 + α246x12 + α244x11 + α135x10 + α150x9 + α223x8 + α133x7 + α100x6 + α113x5 + α0x4 + α39x3 + α205x2 + α185x + α225"
    )
}
